{"data": 0, "raw": 1, "vllm": 2, "10": 3, "find_cuda_init": 4, "py": 5, "def": 6, "find": 7, "cuda": 8, "init": 9, "fn": 10, "callable": 11, "object": 12, "none": 13, "helper": 14, "function": 15, "debug": 16, "re": 17, "initialization": 18, "errors": 19, "initializes": 20, "prints": 21, "stack": 22, "trace": 23, "how": 24, "happens": 25, "from": 26, "torch": 27, "import": 28, "lazy": 29, "wrapper": 30, "nonlocal": 31, "traceback": 32, "extract": 33, "return": 34, "patch": 35, "print": 36, "initialized": 37, "join": 38, "format": 39, "list": 40, "strip": 41, "setup": 42, "load": 43, "module": 44, "path": 45, "name": 46, "spec": 47, "importlib": 48, "util": 49, "file": 50, "location": 51, "sys": 52, "modules": 53, "loader": 54, "exec": 55, "sccache": 56, "available": 57, "bool": 58, "which": 59, "int": 60, "os": 61, "getenv": 62, "disable": 63, "ccache": 64, "ninja": 65, "url": 66, "str": 67, "urllib": 68, "request": 69, "urlopen": 70, "status": 71, "try": 72, "except": 73, "exception": 74, "false": 75, "200": 76, "class": 77, "cmake": 78, "extension": 79, "self": 80, "lists": 81, "dir": 82, "kwa": 83, "super": 84, "sources": 85, "limited": 86, "api": 87, "true": 88, "abspath": 89, "build": 90, "ext": 91, "dict": 92, "directories": 93, "have": 94, "been": 95, "configured": 96, "did": 97, "config": 98, "determine": 99, "number": 100, "compilation": 101, "jobs": 102, "optionally": 103, "nvcc": 104, "compile": 105, "threads": 106, "compute": 107, "num": 108, "either": 109, "value": 110, "max": 111, "environment": 112, "variable": 113, "defined": 114, "cpus": 115, "envs": 116, "logger": 117, "info": 118, "using": 119, "else": 120, "sched": 121, "getaffinity": 122, "isn": 123, "universally": 124, "so": 125, "fall": 126, "back": 127, "cpu": 128, "count": 129, "we": 130, "get": 131, "error": 132, "here": 133, "len": 134, "attribute": 135, "version": 136, "11": 137, "when": 138, "set": 139, "reduce": 140, "avoid": 141, "overloading": 142, "system": 143, "perform": 144, "configuration": 145, "single": 146, "configure": 147, "ve": 148, "already": 149, "txt": 150, "exit": 151, "early": 152, "select": 153, "type": 154, "note": 155, "optimization": 156, "level": 157, "default": 158, "cfg": 159, "rel": 160, "deb": 161, "args": 162, "dcmake": 163, "dvllm": 164, "target": 165, "device": 166, "verbose": 167, "makefile": 168, "compiler": 169, "launcher": 170, "cxx": 171, "hip": 172, "elif": 173, "pass": 174, "python": 175, "executable": 176, "can": 177, "exact": 178, "match": 179, "reuse": 180, "dependencies": 181, "subsequent": 182, "calls": 183, "override": 184, "base": 185, "directory": 186, "fetch": 187, "content": 188, "downloads": 189, "root": 190, "deps": 191, "allows": 192, "sharing": 193, "between": 194, "profiles": 195, "plays": 196, "more": 197, "nicely": 198, "fetchcontent": 199, "fc": 200, "environ": 201, "dfetchcontent": 202, "parallelism": 203, "tool": 204, "job": 205, "dnvcc": 206, "pool": 207, "string": 208, "pools": 209, "whatever": 210, "picks": 211, "make": 212, "sure": 213, "use": 214, "home": 215, "bin": 216, "subprocess": 217, "check": 218, "call": 219, "cwd": 220, "temp": 221, "extensions": 222, "ensure": 223, "present": 224, "working": 225, "output": 226, "oserror": 227, "raise": 228, "runtime": 229, "cannot": 230, "create": 231, "does": 232, "exist": 233, "exists": 234, "makedirs": 235, "targets": 236, "removeprefix": 237, "flash": 238, "attn": 239, "all": 240, "append": 241, "install": 242, "libraries": 243, "proper": 244, "outdir": 245, "fullpath": 246, "parent": 247, "absolute": 248, "skip": 249, "directo": 250, "ry": 251, "same": 252, "continue": 253, "appends": 254, "prefix": 255, "contains": 256, "need": 257, "remove": 258, "range": 259, "should": 260, "actually": 261, "components": 262, "component": 263, "run": 264, "first": 265, "standard": 266, "command": 267, "copy": 268, "lib": 269, "current": 270, "included": 271, "editable": 272, "glob": 273, "files": 274, "recursive": 275, "dst": 276, "split": 277, "copying": 278, "dirname": 279, "ok": 280, "precompiled": 281, "disables": 282, "building": 283, "binaries": 284, "assert": 285, "only": 286, "supported": 287, "builds": 288, "skipping": 289, "wheel": 290, "utils": 291, "extracts": 292, "other": 293, "existing": 294, "staticmethod": 295, "package": 296, "tempfile": 297, "zipfile": 298, "isfile": 299, "filename": 300, "mkdtemp": 301, "wheels": 302, "downloading": 303, "urlretrieve": 304, "zip": 305, "abi3": 306, "moe": 307, "flashmla": 308, "fa2": 309, "fa3": 310, "cumem": 311, "allocator": 312, "compiled": 313, "regex": 314, "members": 315, "filter": 316, "lambda": 317, "filelist": 318, "pa": 319, "th": 320, "open": 321, "src": 322, "wb": 323, "shutil": 324, "copyfileobj": 325, "pkg": 326, "replace": 327, "setdefault": 328, "basename": 329, "finally": 330, "removing": 331, "temporary": 332, "rmtree": 333, "commit": 334, "main": 335, "branch": 336, "force": 337, "nightly": 338, "mainly": 339, "used": 340, "ci": 341, "testing": 342, "test": 343, "latest": 344, "hash": 345, "upstream": 346, "resp": 347, "json": 348, "curl": 349, "https": 350, "github": 351, "com": 352, "repos": 353, "project": 354, "commits": 355, "decode": 356, "utf": 357, "loads": 358, "sha": 359, "docker": 360, "context": 361, "git": 362, "may": 363, "immutable": 364, "missing": 365, "local": 366, "repo": 367, "cat": 368, "called": 369, "process": 370, "remote": 371, "repository": 372, "update": 373, "any": 374, "branches": 375, "ensures": 376, "ref": 377, "its": 378, "history": 379, "our": 380, "show": 381, "merge": 382, "err": 383, "warning": 384, "failed": 385, "compatible": 386, "your": 387, "dev": 388, "empty": 389, "has": 390, "neuron": 391, "tpu": 392, "rocm": 393, "xpu": 394, "custom": 395, "ops": 396, "librocm": 397, "core": 398, "see": 399, "blob": 400, "d11f5c20d500f729c393680a01fa902ebf92094b": 401, "cpp": 402, "l21": 403, "ctypes": 404, "cdll": 405, "ver": 406, "uint32": 407, "restype": 408, "argtypes": 409, "pointer": 410, "major": 411, "minor": 412, "byref": 413, "neuronxcc": 414, "sysconfig": 415, "site": 416, "paths": 417, "purelib": 418, "executed": 419, "successfully": 420, "fp": 421, "read": 422, "regular": 423, "expression": 424, "search": 425, "group": 426, "could": 427, "adapted": 428, "nvidia": 429, "apex": 430, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 431, "universal": 432, "newlines": 433, "release": 434, "idx": 435, "index": 436, "parse": 437, "gaudi": 438, "sw": 439, "returns": 440, "driver": 441, "enable": 442, "console": 443, "printing": 444, "hl": 445, "smi": 446, "shell": 447, "text": 448, "capture": 449, "env": 450, "returncode": 451, "stdout": 452, "write": 453, "sep": 454, "versions": 455, "might": 456, "contain": 457, "source": 458, "tarball": 459, "required": 460, "pypi": 461, "sdist": 462, "argv": 463, "cu": 464, "unknown": 465, "requirements": 466, "resolved": 467, "line": 468, "startswith": 469, "common": 470, "modified": 471, "req": 472, "12": 473, "built": 474, "unsupported": 475, "platform": 476, "please": 477, "use_existing_torch": 478, "spdx": 479, "license": 480, "identifier": 481, "apache": 482, "copyright": 483, "contributors": 484, "llm": 485, "requires": 486, "pyproject": 487, "toml": 488, "cleaning": 489, "lines": 490, "readlines": 491, "lower": 492, "removed": 493, "done": 494, "benchmarks": 495, "backend_request_func": 496, "func": 497, "input": 498, "prompt": 499, "model": 500, "optional": 501, "logprobs": 502, "extra": 503, "body": 504, "multi": 505, "modal": 506, "ignore": 507, "eos": 508, "language": 509, "generated": 510, "success": 511, "latency": 512, "float": 513, "tokens": 514, "ttft": 515, "time": 516, "token": 517, "itl": 518, "field": 519, "factory": 520, "inter": 521, "latencies": 522, "tpot": 523, "avg": 524, "next": 525, "async": 526, "tgi": 527, "pbar": 528, "tqdm": 529, "endswith": 530, "generate": 531, "stream": 532, "aiohttp": 533, "client": 534, "session": 535, "trust": 536, "timeout": 537, "params": 538, "new": 539, "do": 540, "sample": 541, "temperature": 542, "01": 543, "accept": 544, "top": 545, "99": 546, "truncate": 547, "payload": 548, "inputs": 549, "parameters": 550, "st": 551, "perf": 552, "counter": 553, "most": 554, "recent": 555, "timestamp": 556, "post": 557, "response": 558, "chunk": 559, "bytes": 560, "sometimes": 561, "ping": 562, "without": 563, "decoding": 564, "phase": 565, "reason": 566, "exc": 567, "trt": 568, "accumulate": 569, "min": 570, "length": 571, "deepspeed": 572, "mii": 573, "completions": 574, "profile": 575, "ai": 576, "must": 577, "end": 578, "headers": 579, "authorization": 580, "bearer": 581, "openai": 582, "key": 583, "deep": 584, "speed": 585, "doesn": 586, "support": 587, "streaming": 588, "jan": 589, "28": 590, "2024": 591, "placeholder": 592, "microsoft": 593, "pull": 594, "311": 595, "parsed": 596, "await": 597, "choices": 598, "unexpected": 599, "neither": 600, "nor": 601, "found": 602, "els": 603, "repetition": 604, "penalty": 605, "options": 606, "include": 607, "usage": 608, "received": 609, "some": 610, "completion": 611, "last": 612, "summary": 613, "want": 614, "special": 615, "never": 616, "valid": 617, "calculate": 618, "marked": 619, "fal": 620, "se": 621, "chat": 622, "mm": 623, "isinstance": 624, "extend": 625, "messages": 626, "role": 627, "user": 628, "application": 629, "tim": 630, "estamp": 631, "sse": 632, "comments": 633, "often": 634, "pings": 635, "start": 636, "colon": 637, "skipped": 638, "delta": 639, "audio": 640, "dep": 641, "soundfile": 642, "transcriptions": 643, "translations": 644, "en": 645, "flattened": 646, "due": 647, "multipart": 648, "form": 649, "continuous": 650, "stats": 651, "send": 652, "sr": 653, "buffer": 654, "io": 655, "wav": 656, "seek": 657, "containing": 658, "add": 659, "items": 660, "pretrained": 661, "modelscope": 662, "snapshot": 663, "download": 664, "executor": 665, "weight": 666, "lock": 667, "prevent": 668, "multiple": 669, "processes": 670, "weights": 671, "id": 672, "huggingface": 673, "hub": 674, "constants": 675, "hf": 676, "offline": 677, "pattern": 678, "pt": 679, "safetensors": 680, "tokenizer": 681, "mode": 682, "auto": 683, "code": 684, "kwargs": 685, "union": 686, "pre": 687, "trained": 688, "fast": 689, "slow": 690, "mistral": 691, "transformers": 692, "pip": 693, "benchmark_block_pool": 694, "rows": 695, "allocate": 696, "block": 697, "blocks": 698, "enforce": 699, "gc": 700, "collect": 701, "ahead": 702, "minimize": 703, "impact": 704, "among": 705, "runs": 706, "gpu": 707, "caching": 708, "times": 709, "collector": 710, "us": 711, "free": 712, "iteration": 713, "cnt": 714, "dump": 715, "tabulate": 716, "iterations": 717, "total": 718, "allocated": 719, "tablefmt": 720, "grid": 721, "floatfmt": 722, "3f": 723, "invoke": 724, "parser": 725, "flexible": 726, "argument": 727, "description": 728, "benchmark": 729, "performance": 730, "kv": 731, "cache": 732, "100000": 733, "1000": 734, "help": 735, "stablize": 736, "final": 737, "readings": 738, "nargs": 739, "50": 740, "100": 741, "500": 742, "benchmark_dataset": 743, "represents": 744, "inference": 745, "benchmarking": 746, "expected": 747, "lora": 748, "lo": 749, "rarequest": 750, "dataset": 751, "abc": 752, "seed": 753, "multimodal": 754, "random": 755, "initialize": 756, "indicates": 757, "reproducible": 758, "shuffling": 759, "sampling": 760, "defaults": 761, "ensuring": 762, "replaced": 763, "apply": 764, "transformation": 765, "transform": 766, "method": 767, "models": 768, "expect": 769, "specific": 770, "conversation": 771, "overridden": 772, "subclasses": 773, "since": 774, "vary": 775, "depending": 776, "raises": 777, "implemented": 778, "subclass": 779, "implement": 780, "todo": 781, "jenniferzhao": 782, "loras": 783, "option": 784, "al": 785, "tuple": 786, "ra": 787, "associated": 788, "provided": 789, "randomly": 790, "selects": 791, "based": 792, "retrieves": 793, "cached": 794, "otherwise": 795, "selected": 796, "maximum": 797, "ras": 798, "disk": 799, "where": 800, "element": 801, "applicable": 802, "second": 803, "randint": 804, "abstractmethod": 805, "requests": 806, "abstract": 807, "subcl": 808, "asses": 809, "logic": 810, "generating": 811, "objects": 812, "processing": 813, "maybe": 814, "oversample": 815, "oversamples": 816, "size": 817, "less": 818, "than": 819, "desired": 820, "sampled": 821, "additional": 822, "oversampled": 823, "reach": 824, "samples": 825, "sequence": 826, "1024": 827, "2048": 828, "validate": 829, "lengths": 830, "pruning": 831, "criteria": 832, "copied": 833, "original": 834, "sharegpt": 835, "functions": 836, "serving": 837, "well": 838, "throughput": 839, "invalid": 840, "conditions": 841, "too": 842, "short": 843, "long": 844, "combined": 845, "met": 846, "adapter": 847, "image": 848, "mapping": 849, "multimedia": 850, "dictionary": 851, "supports": 852, "three": 853, "types": 854, "expects": 855, "pil": 856, "converts": 857, "rgb": 858, "saves": 859, "jpeg": 860, "memory": 861, "encodes": 862, "base64": 863, "treats": 864, "prepends": 865, "http": 866, "convert": 867, "save": 868, "b64encode": 869, "getvalue": 870, "values": 871, "ratio": 872, "128": 873, "vocab": 874, "real": 875, "ids": 876, "np": 877, "tolist": 878, "low": 879, "high": 880, "bound": 881, "least": 882, "cause": 883, "failures": 884, "logging": 885, "debugging": 886, "lens": 887, "offsets": 888, "inner": 889, "seq": 890, "arange": 891, "after": 892, "encode": 893, "again": 894, "because": 895, "cases": 896, "consecutive": 897, "give": 898, "tokenized": 899, "example": 900, "gpt2tokenizer": 901, "6880": 902, "6881": 903, "ġcalls": 904, "1650": 905, "939": 906, "486": 907, "ġcall": 908, "sh": 909, "ere": 910, "uncontrolled": 911, "change": 912, "encoded": 913, "truncated": 914, "before": 915, "being": 916, "share": 917, "gptdataset": 918, "implements": 919, "gpt": 920, "generates": 921, "turns": 922, "loading": 923, "encoding": 924, "entries": 925, "two": 926, "entry": 927, "conversations": 928, "shuffle": 929, "break": 930, "also": 931, "gpt4video": 932, "jsonl": 933, "what": 934, "capital": 935, "india": 936, "iran": 937, "china": 938, "dictionaries": 939, "standardized": 940, "filetype": 941, "assume": 942, "pd": 943, "buf": 944, "column": 945, "columns": 946, "each": 947, "row": 948, "frame": 949, "corresponds": 950, "iterrows": 951, "template": 952, "item": 953, "generation": 954, "tokenize": 955, "sonnet": 956, "simplified": 957, "implementation": 958, "poem": 959, "550": 960, "150": 961, "formatted": 962, "average": 963, "sum": 964, "pick": 965, "many": 966, "you": 967, "msg": 968, "fmt": 969, "offset": 970, "higher": 971, "round": 972, "while": 973, "burst": 974, "csv": 975, "synthetic": 976, "positive": 977, "df": 978, "keep": 979, "gpt4": 980, "loaded": 981, "state": 982, "dataframe": 983, "ist": 984, "computed": 985, "modulo": 986, "hugging": 987, "face": 988, "datasets": 989, "hosted": 990, "subset": 991, "lmms": 992, "lab": 993, "lla": 994, "va": 995, "one": 996, "vision": 997, "aeala": 998, "vicuna": 999, "unfiltered": 1000, "examples": 1001, "filtered": 1002, "dynamic": 1003, "conv": 1004, "enabled": 1005, "longer": 1006, "accurate": 1007, "actual": 1008, "arena": 1009, "lmarena": 1010, "bench": 1011, "v0": 1012, "images": 1013, "instruct": 1014, "coder": 1015, "co": 1016, "likaixin": 1017, "designed": 1018, "general": 1019, "editing": 1020, "consists": 1021, "114": 1022, "239": 1023, "instruction": 1024, "triplets": 1025, "covers": 1026, "distinct": 1027, "scenario": 1028, "just": 1029, "explanation": 1030, "mtbench": 1031, "mt": 1032, "philschmid": 1033, "turn": 1034, "similar": 1035, "9d98ab5ec": 1036, "eagle": 1037, "l14": 1038, "l18": 1039, "noqa": 1040, "e501": 1041, "256": 1042, "sd": 1043, "aimodataset": 1044, "aimo": 1045, "reasoning": 1046, "questions": 1047, "mo": 1048, "validation": 1049, "aime": 1050, "numina": 1051, "math": 1052, "problem": 1053, "solution": 1054, "32000": 1055, "zeta": 1056, "marker": 1057, "region": 1058, "edit": 1059, "prediction": 1060, "nep": 1061, "formats": 1062, "prompts": 1063, "outputs": 1064, "further": 1065, "extended": 1066, "events": 1067, "indicating": 1068, "following": 1069, "focused": 1070, "zed": 1071, "industries": 1072, "funcs": 1073, "formatting": 1074, "asrdataset": 1075, "asr": 1076, "transcription": 1077, "tested": 1078, "domain": 1079, "speaking": 1080, "style": 1081, "ted": 1082, "lium": 1083, "talks": 1084, "oratory": 1085, "release1": 1086, "release2": 1087, "release3": 1088, "speaker": 1089, "adaptation": 1090, "vox": 1091, "populi": 1092, "european": 1093, "parliament": 1094, "de": 1095, "fr": 1096, "libri": 1097, "speech": 1098, "audiobook": 1099, "narrated": 1100, "tedlium": 1101, "giga": 1102, "podcast": 1103, "tube": 1104, "spontaneous": 1105, "xs": 1106, "xl": 1107, "spgispeech": 1108, "financial": 1109, "meetings": 1110, "ami": 1111, "ihm": 1112, "sdm": 1113, "openslr": 1114, "librispeech": 1115, "facebook": 1116, "voxpopuli": 1117, "edinburghcstr": 1118, "speechcolab": 1119, "gigaspeech": 1120, "kensho": 1121, "whisper": 1122, "interface": 1123, "preamble": 1124, "startoftranscript": 1125, "transcribe": 1126, "notimestamps": 1127, "audios": 1128, "librosa": 1129, "array": 1130, "rate": 1131, "duration": 1132, "30": 1133, "discarded": 1134, "greater": 1135, "benchmark_latency": 1136, "pytorch": 1137, "argparse": 1138, "namespace": 1139, "results": 1140, "records": 1141, "metrics": 1142, "percentiles": 1143, "splitext": 1144, "engine": 1145, "cli": 1146, "woosuk": 1147, "processed": 1148, "batch": 1149, "automatically": 1150, "batches": 1151, "dataclasses": 1152, "asdict": 1153, "detokenize": 1154, "dummy": 1155, "10000": 1156, "beam": 1157, "width": 1158, "stop": 1159, "warming": 1160, "up": 1161, "iters": 1162, "warmup": 1163, "desc": 1164, "torc": 1165, "profiler": 1166, "profiling": 1167, "saved": 1168, "percentages": 1169, "25": 1170, "75": 1171, "90": 1172, "percentile": 1173, "mean": 1174, "seconds": 1175, "percentage": 1176, "specified": 1177, "indent": 1178, "till": 1179, "32": 1180, "sequences": 1181, "per": 1182, "action": 1183, "store": 1184, "responses": 1185, "detokenization": 1186, "measurement": 1187, "v1": 1188, "enables": 1189, "skews": 1190, "numbers": 1191, "benchmark_long_document_qa_throughput": 1192, "document": 1193, "qa": 1194, "given": 1195, "spent": 1196, "parameter": 1197, "strings": 1198, "execute": 1199, "4f": 1200, "secs": 1201, "repeat": 1202, "order": 1203, "depends": 1204, "repeated": 1205, "modes": 1206, "tile": 1207, "entire": 1208, "interleave": 1209, "consecutively": 1210, "moving": 1211, "prepare": 1212, "beginning": 1213, "documents": 1214, "hi": 1215, "warm": 1216, "automatic": 1217, "roughly": 1218, "paper": 1219, "excluding": 1220, "20000": 1221, "details": 1222, "benchmark_ngram_proposer": 1223, "ngram": 1224, "opt": 1225, "125m": 1226, "task": 1227, "dtype": 1228, "proposer": 1229, "speculative": 1230, "lookup": 1231, "propose": 1232, "20": 1233, "gram": 1234, "drafting": 1235, "1500": 1236, "minimum": 1237, "15": 1238, "benchmark_prefix_caching": 1239, "cost": 1240, "fixed": 1241, "small": 1242, "out": 1243, "unique": 1244, "part": 1245, "sort": 1246, "map": 1247, "helpful": 1248, "p50": 1249, "sorted": 1250, "specifies": 1251, "added": 1252, "subtract": 1253, "filtering": 1254, "benchmark_prioritization": 1255, "flag": 1256, "prune": 1257, "priority": 1258, "synthesize": 1259, "backend": 1260, "elapsed": 1261, "2f": 1262, "overrides": 1263, "benchmark_serving": 1264, "completed": 1265, "goodput": 1266, "ms": 1267, "median": 1268, "std": 1269, "e2el": 1270, "stands": 1271, "taken": 1272, "side": 1273, "sending": 1274, "receiving": 1275, "complete": 1276, "dur": 1277, "good": 1278, "itls": 1279, "tpots": 1280, "ttfts": 1281, "e2els": 1282, "backends": 1283, "instead": 1284, "looking": 1285, "bundled": 1286, "together": 1287, "inflate": 1288, "slightly": 1289, "minus": 1290, "regard": 1291, "slo": 1292, "milliseconds": 1293, "conversion": 1294, "metric": 1295, "warnings": 1296, "warn": 1297, "likely": 1298, "misconfiguration": 1299, "arguments": 1300, "stacklevel": 1301, "burstiness": 1302, "concurrency": 1303, "iterable": 1304, "ramp": 1305, "strategy": 1306, "literal": 1307, "linear": 1308, "exponential": 1309, "rps": 1310, "starting": 1311, "initial": 1312, "correctly": 1313, "choose": 1314, "iter": 1315, "choice": 1316, "started": 1317, "distribution": 1318, "poisson": 1319, "gamma": 1320, "traffic": 1321, "increase": 1322, "over": 1323, "factor": 1324, "once": 1325, "simplify": 1326, "semaphore": 1327, "asyncio": 1328, "contextlib": 1329, "nullcontext": 1330, "tasks": 1331, "datetime": 1332, "now": 1333, "isoformat": 1334, "val": 1335, "ogprobs": 1336, "gather": 1337, "close": 1338, "result": 1339, "40": 1340, "successful": 1341, "inf": 1342, "tok": 1343, "metr": 1344, "ics": 1345, "texts": 1346, "header": 1347, "adds": 1348, "statistics": 1349, "getattr": 1350, "medi": 1351, "word": 1352, "excl": 1353, "1st": 1354, "stopping": 1355, "stopped": 1356, "names": 1357, "service": 1358, "objective": 1359, "non": 1360, "negative": 1361, "pairs": 1362, "pair": 1363, "objectives": 1364, "specify": 1365, "p99": 1366, "useful": 1367, "rather": 1368, "big": 1369, "later": 1370, "needed": 1371, "ignored": 1372, "don": 1373, "suffix": 1374, "served": 1375, "controlled": 1376, "both": 1377, "endpoint": 1378, "host": 1379, "port": 1380, "corresponding": 1381, "ataset": 1382, "train": 1383, "lass": 1384, "cls": 1385, "consider": 1386, "contributing": 1387, "would": 1388, "like": 1389, "follow": 1390, "structure": 1391, "burstgpt": 1392, "greedy": 1393, "ackend": 1394, "llama": 1395, "static": 1396, "pause": 1397, "freeze": 1398, "dt": 1399, "strftime": 1400, "date": 1401, "metadata": 1402, "kvstring": 1403, "er": 1404, "ror": 1405, "detailed": 1406, "fields": 1407, "points": 1408, "del": 1409, "qps": 1410, "outfile": 1411, "newline": 1412, "tell": 1413, "online": 1414, "keys": 1415, "server": 1416, "127": 1417, "localhost": 1418, "ipv4": 1419, "8000": 1420, "concurrent": 1421, "simulate": 1422, "enforcing": 1423, "controls": 1424, "initiated": 1425, "control": 1426, "allowed": 1427, "means": 1428, "combination": 1429, "enough": 1430, "unspecified": 1431, "disabled": 1432, "logprob": 1433, "returned": 1434, "sent": 1435, "arrival": 1436, "take": 1437, "effect": 1438, "follows": 1439, "intervals": 1440, "bursty": 1441, "uniform": 1442, "arser": 1443, "progress": 1444, "bar": 1445, "launched": 1446, "saving": 1447, "whether": 1448, "information": 1449, "ttfs": 1450, "etc": 1451, "metavar": 1452, "tp": 1453, "record": 1454, "keeping": 1455, "purposes": 1456, "comma": 1457, "separated": 1458, "report": 1459, "percentils": 1460, "spaces": 1461, "definition": 1462, "refer": 1463, "dist": 1464, "serve": 1465, "arxiv": 1466, "org": 1467, "pdf": 1468, "2401": 1469, "09670": 1470, "blog": 1471, "hao": 1472, "blogs": 1473, "distserve": 1474, "applying": 1475, "define": 1476, "symmetric": 1477, "om": 1478, "always": 1479, "preregistered": 1480, "passed": 1481, "launching": 1482, "script": 1483, "chooses": 1484, "needs": 1485, "ending": 1486, "benchmark_serving_structured_output": 1487, "representing": 1488, "attributes": 1489, "schema": 1490, "realpath": 1491, "structured": 1492, "schemas": 1493, "deepcopy": 1494, "properties": 1495, "uuid": 1496, "uuid4": 1497, "gen": 1498, "brief": 1499, "dumps": 1500, "grammar": 1501, "statement": 1502, "table": 1503, "condition": 1504, "col": 1505, "sql": 1506, "query": 1507, "username": 1508, "email": 1509, "users": 1510, "address": 1511, "alan": 1512, "turing": 1513, "who": 1514, "works": 1515, "enigma": 1516, "classify": 1517, "sentiment": 1518, "wonderful": 1519, "datas": 1520, "et": 1521, "xgrammar": 1522, "nous": 1523, "research": 1524, "eval": 1525, "full": 1526, "features": 1527, "point": 1528, "generator": 1529, "asynchronously": 1530, "represented": 1531, "takes": 1532, "scale": 1533, "theta": 1534, "maintain": 1535, "enumerate": 1536, "yield": 1537, "infinity": 1538, "wait": 1539, "interval": 1540, "shape": 1541, "sleep": 1542, "mill": 1543, "iseconds": 1544, "centiles": 1545, "series": 1546, "describe": 1547, "ret": 1548, "gt": 1549, "evaluate": 1550, "correctness": 1551, "guided": 1552, "scores": 1553, "res": 1554, "score": 1555, "correct": 1556, "he": 1557, "lp": 1558, "benchmark_throughput": 1559, "recommended": 1560, "properly": 1561, "handles": 1562, "frontend": 1563, "multiprocessing": 1564, "generators": 1565, "sp": 1566, "lr": 1567, "param": 1568, "gens": 1569, "iterators": 1570, "causal": 1571, "lm": 1572, "float16": 1573, "padding": 1574, "pad": 1575, "tensors": 1576, "sk": 1577, "ip": 1578, "clear": 1579, "tensor": 1580, "parallel": 1581, "terminate": 1582, "sub": 1583, "uvloop": 1584, "ro": 1585, "033": 1586, "91m": 1587, "0m": 1588, "detected": 1589, "counted": 1590, "issues": 1591, "9778": 1592, "counts": 1593, "deprecation": 1594, "defaulting": 1595, "deprecated": 1596, "checks": 1597, "vll": 1598, "settings": 1599, "validations": 1600, "quantization": 1601, "currently": 1602, "16222": 1603, "ync": 1604, "decoupled": 1605, "adapters": 1606, "relative": 1607, "much": 1608, "versus": 1609, "remains": 1610, "approximately": 1611, "dtaset": 1612, "benchmark_utils": 1613, "oss": 1614, "wiki": 1615, "integrate": 1616, "database": 1617, "vars": 1618, "encoder": 1619, "jsonencoder": 1620, "isinf": 1621, "iterencode": 1622, "serializable": 1623, "ns": 1624, "monotonic": 1625, "enter": 1626, "hipify": 1627, "usr": 1628, "python3": 1629, "running": 1630, "preprocessor": 1631, "live": 1632, "hipified": 1633, "written": 1634, "limit": 1635, "scope": 1636, "includes": 1637, "hold": 1638, "copytree": 1639, "dirs": 1640, "abs": 1641, "tests": 1642, "build_cython": 1643, "cython": 1644, "cythonize": 1645, "setuptools": 1646, "annotate": 1647, "infiles": 1648, "detokenizer": 1649, "processor": 1650, "step": 1651, "checker": 1652, "scheduler": 1653, "manager": 1654, "layers": 1655, "sampler": 1656, "directives": 1657, "infer": 1658, "inplace": 1659, "conftest": 1660, "asset": 1661, "typed": 1662, "sign": 1663, "cherry": 1664, "blossom": 1665, "assets": 1666, "convenience": 1667, "matches": 1668, "iterating": 1669, "through": 1670, "video": 1671, "baby": 1672, "reading": 1673, "mary": 1674, "had": 1675, "lamb": 1676, "winning": 1677, "cleanup": 1678, "monkeypatch": 1679, "oracle": 1680, "sets": 1681, "during": 1682, "invocation": 1683, "touch": 1684, "changes": 1685, "made": 1686, "cleaned": 1687, "fixture": 1688, "every": 1689, "delete": 1690, "clean": 1691, "upon": 1692, "modifies": 1693, "setenv": 1694, "delenv": 1695, "engines": 1696, "twice": 1697, "decorated": 1698, "node": 1699, "closest": 1700, "pytest": 1701, "connection": 1702, "different": 1703, "event": 1704, "loop": 1705, "created": 1706, "anew": 1707, "global": 1708, "mkstemp": 1709, "distributed": 1710, "world": 1711, "rank": 1712, "nccl": 1713, "allow": 1714, "subdirectories": 1715, "overriding": 1716, "provide": 1717, "10x": 1718, "speedup": 1719, "unit": 1720, "dynamo": 1721, "reset": 1722, "message": 1723, "decoder": 1724, "enum": 1725, "explicit": 1726, "wherein": 1727, "reverse": 1728, "enc": 1729, "dec": 1730, "runner": 1731, "platforms": 1732, "wrap": 1733, "hasattr": 1734, "sentence": 1735, "transformer": 1736, "cross": 1737, "redirect": 1738, "verify": 1739, "pooling": 1740, "amd": 1741, "automodel": 1742, "case": 1743, "unquantized": 1744, "bitsandbytes": 1745, "put": 1746, "f401": 1747, "videos": 1748, "feature": 1749, "hack": 1750, "processors": 1751, "future": 1752, "embeddings": 1753, "embedding": 1754, "squeeze": 1755, "logits": 1756, "softmax": 1757, "dim": 1758, "tokenization": 1759, "beams": 1760, "hidden": 1761, "states": 1762, "matmul": 1763, "bias": 1764, "unsqueeze": 1765, "log": 1766, "float32": 1767, "lst": 1768, "drop": 1769, "reshape": 1770, "topk": 1771, "dct": 1772, "indices": 1773, "strs": 1774, "predict": 1775, "reproducibility": 1776, "64": 1777, "devices": 1778, "16": 1779, "chunked": 1780, "prefill": 1781, "eager": 1782, "graph": 1783, "swap": 1784, "space": 1785, "embeds": 1786, "steps": 1787, "toks": 1788, "logsprobs": 1789, "omit": 1790, "logp": 1791, "robs": 1792, "probs": 1793, "embed": 1794, "reward": 1795, "nn": 1796, "insecure": 1797, "serialization": 1798, "collective": 1799, "rpc": 1800, "propagate": 1801, "caplog": 1802, "temporarily": 1803, "logs": 1804, "propagated": 1805, "gpus": 1806, "initializing": 1807, "patterns": 1808, "h5": 1809, "msgpack": 1810, "architectures": 1811, "my": 1812, "optfor": 1813, "llava": 1814, "7b": 1815, "gemma2": 1816, "baai": 1817, "bge": 1818, "multilingual": 1819, "gemma2embedding": 1820, "addoption": 1821, "collection": 1822, "modifyitems": 1823, "getoption": 1824, "mark": 1825, "keywords": 1826, "yaml": 1827, "test_cache_block_hashing": 1828, "flatten": 1829, "2d": 1830, "li": 1831, "lss": 1832, "ls": 1833, "seqs": 1834, "hashes": 1835, "prefixes": 1836, "everywhere": 1837, "hash0": 1838, "hash1": 1839, "until": 1840, "pref": 1841, "ha": 1842, "test_config": 1843, "repr": 1844, "succeeds": 1845, "mutates": 1846, "inductor": 1847, "passes": 1848, "nested": 1849, "simple": 1850, "config1": 1851, "42": 1852, "nonexistent": 1853, "assertion": 1854, "dataclass": 1855, "config2": 1856, "config3": 1857, "draft": 1858, "sliding": 1859, "window": 1860, "mini": 1861, "l12": 1862, "v2": 1863, "pooler": 1864, "normalize": 1865, "bert": 1866, "512": 1867, "rope": 1868, "customization": 1869, "scaling": 1870, "000": 1871, "longchat": 1872, "meta": 1873, "8b": 1874, "8192": 1875, "16384": 1876, "lmsys": 1877, "13b": 1878, "16k": 1879, "4096": 1880, "uses": 1881, "mrope": 1882, "qwen": 1883, "qwen2": 1884, "5b": 1885, "diff": 1886, "directly": 1887, "configurations": 1888, "test_embedded_commit": 1889, "embedded": 1890, "test_inputs": 1891, "consistent": 1892, "slice": 1893, "zipping": 1894, "another": 1895, "zipped": 1896, "exp": 1897, "test_logger": 1898, "f1": 1899, "f2": 1900, "fd": 1901, "cur": 1902, "settrace": 1903, "presumes": 1904, "behavior": 1905, "activated": 1906, "handler": 1907, "handlers": 1908, "formatter": 1909, "datefmt": 1910, "descendent": 1911, "loggers": 1912, "depend": 1913, "notset": 1914, "hello": 1915, "emit": 1916, "handle": 1917, "mock": 1918, "levelno": 1919, "configuring": 1920, "however": 1921, "mocks": 1922, "occur": 1923, "raised": 1924, "fails": 1925, "occurs": 1926, "ex": 1927, "e721": 1928, "named": 1929, "nloggers": 1930, "nversion": 1931, "flush": 1932, "jsondecode": 1933, "expecting": 1934, "got": 1935, "causes": 1936, "off": 1937, "snippet": 1938, "evaluated": 1939, "remember": 1940, "assumed": 1941, "though": 1942, "obj": 1943, "functionality": 1944, "magic": 1945, "entrypoints": 1946, "basic": 1947, "123": 1948, "finish": 1949, "456": 1950, "789": 1951, "truncation": 1952, "respects": 1953, "setting": 1954, "very": 1955, "characters": 1956, "logged": 1957, "were": 1958, "integration": 1959, "alongside": 1960, "methods": 1961, "interference": 1962, "accumulated": 1963, "test_outputs": 1964, "forward": 1965, "finished": 1966, "arg": 1967, "test_pooling_params": 1968, "activation": 1969, "dimensions": 1970, "matryoshka": 1971, "test_regression": 1972, "duplicated": 1973, "1655": 1974, "distilbert": 1975, "distilgpt2": 1976, "batched": 1977, "say": 1978, "released": 1979, "others": 1980, "50mb": 1981, "usually": 1982, "around": 1983, "10mb": 1984, "monkey": 1985, "cn": 1986, "qwen1": 1987, "fail": 1988, "400": 1989, "bad": 1990, "president": 1991, "united": 1992, "france": 1993, "95": 1994, "test_routing_simulator": 1995, "appropriate": 1996, "experts": 1997, "routing": 1998, "simulator": 1999, "strategies": 2000, "randn": 2001, "router": 2002, "shapes": 2003, "wrong": 2004, "expert": 2005, "large": 2006, "fused": 2007, "importorskip": 2008, "layer": 2009, "simulation": 2010, "reload": 2011, "variables": 2012, "grouped": 2013, "renormalize": 2014, "registering": 2015, "register": 2016, "normal": 2017, "60": 2018, "48": 2019, "instance": 2020, "compatibility": 2021, "work": 2022, "test_sampling_params": 2023, "identified": 2024, "resulting": 2025, "test_scalartype": 2026, "scalar": 2027, "floating": 2028, "finfo": 2029, "iinfo": 2030, "test_seed_behavior": 2031, "everything": 2032, "test_sequence": 2033, "getitem": 2034, "setitem": 2035, "eq": 2036, "output1": 2037, "output2": 2038, "output3": 2039, "uncomputed": 2040, "advance": 2041, "simulating": 2042, "recompute": 2043, "stage": 2044, "test_sharded_state_loader": 2045, "subtensors": 2046, "sharded": 2047, "equal": 2048, "na": 2049, "3p2": 2050, "1b": 2051, "writer": 2052, "worker": 2053, "listdir": 2054, "isdir": 2055, "fnmatch": 2056, "queue": 2057, "mp": 2058, "thread": 2059, "utilization": 2060, "ctx": 2061, "spawn": 2062, "changed": 2063, "hang": 2064, "separate": 2065, "isolation": 2066, "deadlock": 2067, "child": 2068, "writing": 2069, "causing": 2070, "indefinitely": 2071, "22371": 2072, "discussion": 2073, "r2257773814": 2074, "test_test": 2075, "requested": 2076, "ordered": 2077, "ascendingly": 2078, "prev": 2079, "watch": 2080, "prob": 2081, "rankno": 2082, "tid": 2083, "story": 2084, "about": 2085, "robot": 2086, "dreams": 2087, "topkp": 2088, "test_triton_utils": 2089, "triton": 2090, "decorators": 2091, "jit": 2092, "foo": 2093, "autotune": 2094, "heuristics": 2095, "baz": 2096, "configs": 2097, "lang": 2098, "constexpr": 2099, "int64": 2100, "fallback": 2101, "pop": 2102, "importing": 2103, "installed": 2104, "tl": 2105, "test_version": 2106, "test_vllm_port": 2107, "integer": 2108, "5678": 2109, "uri": 2110, "tcp": 2111, "appears": 2112, "aiserver": 2113, "abc123": 2114, "customize": 2115, "launch": 2116, "safe": 2117, "multiproc": 2118, "proc": 2119, "popen": 2120, "stderr": 2121, "manually": 2122, "unix": 2123, "sockets": 2124, "uds": 2125, "mutate": 2126, "su": 2127, "bparsers": 2128, "subparsers": 2129, "dest": 2130, "subparser": 2131, "subcommand": 2132, "240": 2133, "health": 2134, "expired": 2135, "kill": 2136, "poll": 2137, "polling": 2138, "httpx": 2139, "transport": 2140, "httptransport": 2141, "ready": 2142, "yet": 2143, "suppress": 2144, "exited": 2145, "unexpectedly": 2146, "property": 2147, "parts": 2148, "600": 2149, "retries": 2150, "fxn": 2151, "assignment": 2152, "superclass": 2153, "constructor": 2154, "indirectly": 2155, "exitcode": 2156, "alive": 2157, "seeded": 2158, "33": 2159, "text0": 2160, "text1": 2161, "pure": 2162, "feel": 2163, "today": 2164, "compare": 2165, "arg1": 2166, "arg2": 2167, "env1": 2168, "env2": 2169, "environments": 2170, "several": 2171, "comparing": 2172, "upload": 2173, "wikimedia": 2174, "wikipedia": 2175, "commons": 2176, "0b": 2177, "rgba": 2178, "comp": 2179, "png": 2180, "sim": 2181, "cosine": 2182, "similarity": 2183, "999": 2184, "pp": 2185, "ray": 2186, "helps": 2187, "compared": 2188, "workers": 2189, "gitignore": 2190, "move": 2191, "excludes": 2192, "shellcheck": 2193, "refs": 2194, "shutdown": 2195, "category": 2196, "within": 2197, "emitted": 2198, "catch": 2199, "filterwarnings": 2200, "physical": 2201, "visible": 2202, "threshold": 2203, "120": 2204, "nvml": 2205, "amdsmi": 2206, "mem": 2207, "vram": 2208, "gb": 2209, "02f": 2210, "gi": 2211, "waiting": 2212, "fork": 2213, "decorator": 2214, "7053": 2215, "functools": 2216, "wraps": 2217, "leader": 2218, "own": 2219, "sigterm": 2220, "setpgrp": 2221, "outcomes": 2222, "pid": 2223, "pgid": 2224, "getpgid": 2225, "waitpid": 2226, "signal": 2227, "itself": 2228, "old": 2229, "sig": 2230, "ign": 2231, "killpg": 2232, "restore": 2233, "tempdir": 2234, "filepath": 2235, "tmp": 2236, "cloudpickle": 2237, "pickling": 2238, "complex": 2239, "cmd": 2240, "creates": 2241, "creation": 2242, "skips": 2243, "meet": 2244, "requirement": 2245, "leveraged": 2246, "via": 2247, "resources": 2248, "occurred": 2249, "finding": 2250, "skipif": 2251, "decorate": 2252, "sufficient": 2253, "machine": 2254, "l4": 2255, "24": 2256, "marks": 2257, "selector": 2258, "stateless": 2259, "reversed": 2260, "construct": 2261, "obtain": 2262, "spin": 2263, "bringing": 2264, "240sec": 2265, "generations": 2266, "protocol": 2267, "operates": 2268, "obtains": 2269, "tree": 2270, "aiter": 2271, "tools": 2272, "check_init_lazy_imports": 2273, "internal": 2274, "violations": 2275, "disallowed": 2276, "imports": 2277, "lineno": 2278, "ast": 2279, "visitor": 2280, "checking": 2281, "visit": 2282, "guard": 2283, "typing": 2284, "attr": 2285, "orelse": 2286, "generic": 2287, "alias": 2288, "inside": 2289, "check_pickle_imports": 2290, "scan": 2291, "pickle": 2292, "splitlines": 2293, "pathspec": 2294, "gitwildmatch": 2295, "dirpath": 2296, "filenames": 2297, "walk": 2298, "relpath": 2299, "intentional": 2300, "pkl": 2301, "cpkl": 2302, "timport": 2303, "somethingelse": 2304, "pickleas": 2305, "asdf": 2306, "check_spdx_header": 2307, "spdxstatus": 2308, "enumeration": 2309, "completely": 2310, "shebang": 2311, "supplement": 2312, "preserve": 2313, "writelines": 2314, "insert": 2315, "fixing": 2316, "fix": 2317, "check_triton_import": 2318, "forbidden": 2319, "stripped": 2320, "staged": 2321, "unified": 2322, "unstaged": 2323, "direct": 2324, "enforce_regex_import": 2325, "am": 2326, "unicode": 2327, "violation": 2328, "generate_cmake_presets": 2329, "cores": 2330, "presets": 2331, "attempting": 2332, "detect": 2333, "prospective": 2334, "development": 2335, "typically": 2336, "virtual": 2337, "venvs": 2338, "assuming": 2339, "resolvable": 2340, "isabs": 2341, "flags": 2342, "preset": 2343, "binary": 2344, "slower": 2345, "sync": 2346, "26": 2347, "overwrite": 2348, "cancelled": 2349, "cd": 2350, "generate_nightly_torch_test": 2351, "specialized": 2352, "reads": 2353, "splits": 2354, "related": 2355, "packages": 2356, "white": 2357, "dependency": 2358, "torchaudio": 2359, "torchvision": 2360, "mamba": 2361, "ssm": 2362, "report_build_time_ninja": 2363, "passing": 2364, "appended": 2365, "owner": 2366, "weighted": 2367, "divides": 2368, "thus": 2369, "approximate": 2370, "serialized": 2371, "serializing": 2372, "durations": 2373, "shorter": 2374, "modest": 2375, "epsilon": 2376, "000002": 2377, "printable": 2378, "summarizes": 2379, "dozens": 2380, "them": 2381, "sanely": 2382, "chosen": 2383, "fit": 2384, "minimizing": 2385, "wrapping": 2386, "65": 2387, "readline": 2388, "v5": 2389, "unrecognized": 2390, "seen": 2391, "exe": 2392, "rudely": 2393, "halted": 2394, "corrupt": 2395, "silently": 2396, "cmdhash": 2397, "restart": 2398, "integral": 2399, "earlier": 2400, "stamp": 2401, "possibly": 2402, "incremental": 2403, "throw": 2404, "away": 2405, "previous": 2406, "displayed": 2407, "independently": 2408, "commands": 2409, "guaranteed": 2410, "go": 2411, "backwards": 2412, "best": 2413, "important": 2414, "canonical": 2415, "ultimately": 2416, "goal": 2417, "grouping": 2418, "mappings": 2419, "javac": 2420, "jar": 2421, "distinguished": 2422, "ext1": 2423, "ext2": 2424, "pdb": 2425, "dll": 2426, "pefile": 2427, "linking": 2428, "listed": 2429, "toc": 2430, "attempt": 2431, "identify": 2432, "identifying": 2433, "categorized": 2434, "mojo": 2435, "jars": 2436, "java": 2437, "mojom": 2438, "summarize": 2439, "exactly": 2440, "iterate": 2441, "track": 2442, "ends": 2443, "easily": 2444, "calculated": 2445, "earliest": 2446, "happen": 2447, "starts": 2448, "stops": 2449, "come": 2450, "alphabet": 2451, "making": 2452, "know": 2453, "deltas": 2454, "efficiently": 2455, "individual": 2456, "moment": 2457, "ran": 2458, "half": 2459, "possible": 2460, "untrustworthy": 2461, "defaultdict": 2462, "longest": 2463, "1f": 2464, "semicolon": 2465, "analyze": 2466, "known": 2467, "room": 2468, "errno": 2469, "enoent": 2470, "validate_config": 2471, "docs": 2472, "docstrings": 2473, "placed": 2474, "assignments": 2475, "davidism": 2476, "mit": 2477, "pairwise": 2478, "library": 2479, "itertools": 2480, "html": 2481, "dropped": 2482, "iterator": 2483, "nodes": 2484, "constant": 2485, "assign": 2486, "ann": 2487, "expr": 2488, "doc": 2489, "inspect": 2490, "cleandoc": 2491, "annotated": 2492, "assigning": 2493, "plain": 2494, "validator": 2495, "stmt": 2496, "annotation": 2497, "var": 2498, "subscript": 2499, "docstring": 2500, "elts": 2501, "literal1": 2502, "literal2": 2503, "validating": 2504, "__init__": 2505, "efficient": 2506, "llms": 2507, "independent": 2508, "assumption": 2509, "critical": 2510, "isort": 2511, "imported": 2512, "attrs": 2513, "llmengine": 2514, "cluster": 2515, "registry": 2516, "classification": 2517, "scoring": 2518, "_custom_ops": 2519, "paged": 2520, "attention": 2521, "heads": 2522, "tables": 2523, "alibi": 2524, "slopes": 2525, "blocksparse": 2526, "vert": 2527, "stride": 2528, "head": 2529, "loc": 2530, "fp8": 2531, "mla": 2532, "kvcache": 2533, "lse": 2534, "vertical": 2535, "slash": 2536, "indexes": 2537, "seqlens": 2538, "nnz": 2539, "zeros": 2540, "mergehead": 2541, "rotary": 2542, "positions": 2543, "cos": 2544, "sin": 2545, "neox": 2546, "rot": 2547, "rms": 2548, "norm": 2549, "contiguous": 2550, "kernel": 2551, "updated": 2552, "residual": 2553, "penalties": 2554, "mask": 2555, "op": 2556, "divide": 2557, "multiply": 2558, "place": 2559, "boolean": 2560, "appear": 2561, "quant": 2562, "ub": 2563, "scales": 2564, "numel": 2565, "awq": 2566, "dequantize": 2567, "qweight": 2568, "thx": 2569, "thy": 2570, "gemm": 2571, "qzeros": 2572, "gptq": 2573, "exllama": 2574, "bit": 2575, "perm": 2576, "marlin": 2577, "workspace": 2578, "cutlass": 2579, "scaled": 2580, "fp4": 2581, "capability": 2582, "blockwise": 2583, "sizes": 2584, "alpha": 2585, "ndim": 2586, "numpy": 2587, "broadcasting": 2588, "v3": 2589, "broadcast": 2590, "rules": 2591, "rule": 2592, "extent": 2593, "dimension": 2594, "along": 2595, "expand": 2596, "bfloat16": 2597, "massage": 2598, "view": 2599, "compressed": 2600, "azp": 2601, "adj": 2602, "channel": 2603, "sparse": 2604, "compress": 2605, "compresses": 2606, "matrix": 2607, "operations": 2608, "dense": 2609, "zero": 2610, "elements": 2611, "representation": 2612, "kernels": 2613, "int8": 2614, "float8": 2615, "e4m3fn": 2616, "nzs": 2617, "compression": 2618, "operation": 2619, "notes": 2620, "uint8": 2621, "sparsity": 2622, "elems": 2623, "elem": 2624, "2b": 2625, "nz": 2626, "bt": 2627, "performs": 2628, "multiplication": 2629, "transposed": 2630, "factors": 2631, "sizes1": 2632, "sizes2": 2633, "permutation": 2634, "blockscale": 2635, "necessary": 2636, "multiplications": 2637, "begins": 2638, "computation": 2639, "mx": 2640, "nx": 2641, "mms": 2642, "executing": 2643, "dst2src": 2644, "according": 2645, "permute": 2646, "performing": 2647, "permuted": 2648, "pplx": 2649, "padded": 2650, "idxs": 2651, "strides": 2652, "act": 2653, "ch": 2654, "executes": 2655, "quantized": 2656, "ab": 2657, "alphas": 2658, "sf": 2659, "blockscaled": 2660, "gemms": 2661, "nvfp4": 2662, "ptrs": 2663, "blockscales": 2664, "e4m3": 2665, "precision": 2666, "repack": 2667, "bits": 2668, "atomic": 2669, "fp32": 2670, "zp": 2671, "machete": 2672, "schedules": 2673, "prepack": 2674, "schedule": 2675, "cols": 2676, "quantize": 2677, "quantizes": 2678, "dynamically": 2679, "shared": 2680, "stored": 2681, "swizzled": 2682, "layout": 2683, "execution": 2684, "tcgen05": 2685, "mma": 2686, "4x": 2687, "packed": 2688, "sizzled": 2689, "dims": 2690, "fp16": 2691, "bf16": 2692, "rounded": 2693, "128x4": 2694, "multiples": 2695, "int32": 2696, "increased": 2697, "larger": 2698, "numtopk": 2699, "observed": 2700, "rch": 2701, "determined": 2702, "downstream": 2703, "benefit": 2704, "upper": 2705, "assumes": 2706, "mi300": 2707, "e3m3fnuz": 2708, "pe": 2709, "allspark": 2710, "rearrange": 2711, "asymmetric": 2712, "n32k16": 2713, "ampere": 2714, "w8a16": 2715, "rearranged": 2716, "32align": 2717, "reorder": 2718, "kn": 2719, "sm": 2720, "cublas": 2721, "qqq": 2722, "ggml": 2723, "mul": 2724, "mat": 2725, "vec": 2726, "a8": 2727, "sym": 2728, "selective": 2729, "fwd": 2730, "softplus": 2731, "slot": 2732, "llmm1": 2733, "wv": 2734, "kq": 2735, "align": 2736, "wna16": 2737, "optimized": 2738, "gating": 2739, "past": 2740, "ep": 2741, "concat": 2742, "caches": 2743, "ruff": 2744, "ar": 2745, "ipc": 2746, "fully": 2747, "connected": 2748, "fa": 2749, "inp": 2750, "reg": 2751, "sz": 2752, "dispose": 2753, "buffers": 2754, "ptr": 2755, "qr": 2756, "destroy": 2757, "cast": 2758, "bf2half": 2759, "equals": 2760, "page": 2761, "qk": 2762, "sqrt": 2763, "nope": 2764, "sm100": 2765, "_ipex_ops": 2766, "ipex": 2767, "x1": 2768, "x2": 2769, "chunks": 2770, "silu": 2771, "functional": 2772, "gelu": 2773, "tanh": 2774, "quick": 2775, "queries": 2776, "attent": 2777, "ion": 2778, "varlen": 2779, "seqlen": 2780, "pdropout": 2781, "left": 2782, "ight": 2783, "soft": 2784, "cap": 2785, "right": 2786, "ca": 2787, "che": 2788, "seqused": 2789, "softcap": 2790, "descale": 2791, "aux": 2792, "cumsum": 2793, "headdim": 2794, "qkv": 2795, "leftpad": 2796, "infinite": 2797, "tuned": 2798, "pack": 2799, "gqa": 2800, "margin": 2801, "sms": 2802, "communication": 2803, "returning": 2804, "bl": 2805, "ocks": 2806, "beam_search": 2807, "keeps": 2808, "probability": 2809, "filled": 2810, "cum": 2811, "cumulative": 2812, "ccb92be23def445f2afdea94c31286f84b89eb5b": 2813, "l938": 2814, "collect_env": 2815, "pipe": 2816, "communicate": 2817, "rc": 2818, "win32": 2819, "oem": 2820, "locale": 2821, "getpreferredencoding": 2822, "topo": 2823, "leading": 2824, "whitespace": 2825, "meaningful": 2826, "rstrip": 2827, "conda": 2828, "gcc": 2829, "clang": 2830, "darwin": 2831, "kextstat": 2832, "grep": 2833, "prop": 2834, "gcn": 2835, "arch": 2836, "gcnarch": 2837, "anonymize": 2838, "cudnn": 2839, "libcudnn": 2840, "hard": 2841, "systemroot": 2842, "windows": 2843, "system32": 2844, "drivers": 2845, "installation": 2846, "guide": 2847, "mac": 2848, "deeplearning": 2849, "sdk": 2850, "installmac": 2851, "elsewhere": 2852, "ldconfig": 2853, "rev": 2854, "cut": 2855, "permission": 2856, "eliminate": 2857, "symbolic": 2858, "links": 2859, "alphabetize": 2860, "deterministic": 2861, "probably": 2862, "linux": 2863, "program": 2864, "programfiles": 2865, "legacy": 2866, "corporation": 2867, "nvsmi": 2868, "smis": 2869, "candidate": 2870, "hipcc": 2871, "archs": 2872, "showtopo": 2873, "lscpu": 2874, "wmic": 2875, "manufacturer": 2876, "family": 2877, "architecture": 2878, "clock": 2879, "l2cache": 2880, "revision": 2881, "sysctl": 2882, "machdep": 2883, "brand": 2884, "cygwin": 2885, "vers": 2886, "product": 2887, "wbem": 2888, "findstr": 2889, "caption": 2890, "lsb": 2891, "pretty": 2892, "ubuntu": 2893, "debian": 2894, "libc": 2895, "mpip": 2896, "uv": 2897, "pip3": 2898, "cachingallocator": 2899, "alloc": 2900, "conf": 2901, "xnnpack": 2902, "secret": 2903, "terms": 2904, "access": 2905, "password": 2906, "omp": 2907, "mkl": 2908, "term": 2909, "miopen": 2910, "rsplit": 2911, "maxsize": 2912, "cud": 2913, "envinfo": 2914, "nones": 2915, "replacement": 2916, "bools": 2917, "yes": 2918, "prepend": 2919, "tag": 2920, "relevant": 2921, "multiline": 2922, "mutable": 2923, "previously": 2924, "ll": 2925, "ie": 2926, "collecting": 2927, "crash": 2928, "minidump": 2929, "getctime": 2930, "ctime": 2931, "fromtimestamp": 2932, "bug": 2933, "connections": 2934, "httpconnection": 2935, "intentionally": 2936, "even": 2937, "accessible": 2938, "urlparse": 2939, "scheme": 2940, "extras": 2941, "agent": 2942, "pat": 2943, "env_override": 2944, "interact": 2945, "whenever": 2946, "overhead": 2947, "cudagraph": 2948, "allreduce": 2949, "1234": 2950, "caps": 2951, "imex": 2952, "channels": 2953, "nvlink": 2954, "gb200": 2955, "nvl72": 2956, "systems": 2957, "ultimate": 2958, "way": 2959, "apis": 2960, "expensive": 2961, "approximation": 2962, "existence": 2963, "across": 2964, "still": 2965, "worthwhile": 2966, "bandwidth": 2967, "15951": 2968, "avoids": 2969, "unintentional": 2970, "10480": 2971, "torchinductor": 2972, "10619": 2973, "xdg": 2974, "expanduser": 2975, "suggest": 2976, "k8s": 2977, "discovery": 2978, "issue": 2979, "caused": 2980, "kubernetes": 2981, "stable": 2982, "evaluation": 2983, "explicitly": 2984, "affects": 2985, "partition": 2986, "graphs": 2987, "affect": 2988, "truth": 2989, "factorize": 2990, "dp": 2991, "standalone": 2992, "flashinfer": 2993, "trtllm": 2994, "mxfp4": 2995, "mxfp8": 2996, "rmsnorm": 2997, "mha": 2998, "skinny": 2999, "mb": 3000, "goes": 3001, "hashlib": 3002, "md5": 3003, "usedforsecurity": 3004, "hexdigest": 3005, "forward_context": 3006, "descriptor": 3007, "dispatching": 3008, "minimal": 3009, "uniquely": 3010, "dispatch": 3011, "supporting": 3012, "lockstep": 3013, "dpmetadata": 3014, "ranks": 3015, "batchsize": 3016, "contextmanager": 3017, "designated": 3018, "portion": 3019, "uneven": 3020, "derive": 3021, "wise": 3022, "piecewise": 3023, "stores": 3024, "inject": 3025, "synchronous": 3026, "scheduling": 3027, "adding": 3028, "synchronize": 3029, "bs": 3030, "medium": 3031, "quantile": 3032, "hashable": 3033, "caller": 3034, "conflicting": 3035, "intel": 3036, "implies": 3037, "unset": 3038, "formatters": 3039, "provides": 3040, "10134": 3041, "purpose": 3042, "retrieved": 3043, "setattr": 3044, "ts": 3045, "deleted": 3046, "partial": 3047, "tracing": 3048, "under": 3049, "hangs": 3050, "crashes": 3051, "calling": 3052, "affected": 3053, "down": 3054, "suggested": 3055, "logits_process": 3056, "words": 3057, "prohibit": 3058, "middle": 3059, "lstrip": 3060, "produces": 3061, "smallest": 3062, "logit": 3063, "neutral": 3064, "bounds": 3065, "vocabulary": 3066, "integers": 3067, "satisfying": 3068, "probabilities": 3069, "position": 3070, "why": 3071, "including": 3072, "encountering": 3073, "extracted": 3074, "whole": 3075, "hit": 3076, "transfer": 3077, "placeholders": 3078, "older": 3079, "breaking": 3080, "ignoring": 3081, "aggregate": 3082, "mpletion": 3083, "classmethod": 3084, "assembled": 3085, "assemble": 3086, "kind": 3087, "pr": 3088, "ompt": 3089, "finishes": 3090, "equest": 3091, "ulti": 3092, "pooled": 3093, "vector": 3094, "floats": 3095, "classes": 3096, "pooling_params": 3097, "msgspec": 3098, 