{"def": 0, "find_cuda_init": 1, "fn": 2, "callable": 3, "object": 4, "none": 5, "helper": 6, "function": 7, "debug": 8, "cuda": 9, "re": 10, "initialization": 11, "errors": 12, "initializes": 13, "prints": 14, "stack": 15, "trace": 16, "how": 17, "happens": 18, "from": 19, "torch": 20, "import": 21, "_lazy_init": 22, "wrapper": 23, "nonlocal": 24, "traceback": 25, "extract_stack": 26, "return": 27, "patch": 28, "print": 29, "initialized": 30, "join": 31, "format_list": 32, "strip": 33, "load_module_from_path": 34, "module_name": 35, "path": 36, "spec": 37, "importlib": 38, "util": 39, "spec_from_file_location": 40, "module": 41, "module_from_spec": 42, "sys": 43, "modules": 44, "loader": 45, "exec_module": 46, "is_sccache_available": 47, "bool": 48, "which": 49, "sccache": 50, "int": 51, "os": 52, "getenv": 53, "vllm_disable_sccache": 54, "is_ccache_available": 55, "ccache": 56, "is_ninja_available": 57, "ninja": 58, "is_url_available": 59, "url": 60, "str": 61, "urllib": 62, "request": 63, "urlopen": 64, "status": 65, "try": 66, "except": 67, "exception": 68, "false": 69, "200": 70, "class": 71, "cmakeextension": 72, "extension": 73, "__init__": 74, "self": 75, "name": 76, "cmake_lists_dir": 77, "kwa": 78, "super": 79, "sources": 80, "py_limited_api": 81, "true": 82, "abspath": 83, "cmake_build_ext": 84, "build_ext": 85, "dict": 86, "directories": 87, "have": 88, "been": 89, "configured": 90, "did_config": 91, "determine": 92, "number": 93, "compilation": 94, "jobs": 95, "optionally": 96, "nvcc": 97, "compile": 98, "threads": 99, "compute_num_jobs": 100, "num_jobs": 101, "either": 102, "value": 103, "max_jobs": 104, "environment": 105, "variable": 106, "defined": 107, "cpus": 108, "available": 109, "envs": 110, "logger": 111, "info": 112, "using": 113, "else": 114, "sched_getaffinity": 115, "isn": 116, "universally": 117, "so": 118, "fall": 119, "back": 120, "cpu_count": 121, "we": 122, "get": 123, "error": 124, "here": 125, "len": 126, "attributeerror": 127, "nvcc_threads": 128, "_is_cuda": 129, "get_nvcc_cuda_version": 130, "version": 131, "11": 132, "when": 133, "set": 134, "reduce": 135, "avoid": 136, "overloading": 137, "system": 138, "max": 139, "perform": 140, "cmake": 141, "configuration": 142, "single": 143, "configure": 144, "ext": 145, "ve": 146, "already": 147, "cmakelists": 148, "txt": 149, "exit": 150, "early": 151, "select": 152, "build": 153, "type": 154, "note": 155, "optimization": 156, "level": 157, "default_cfg": 158, "relwithdebinfo": 159, "cfg": 160, "cmake_build_type": 161, "cmake_args": 162, "dcmake_build_type": 163, "format": 164, "dvllm_target_device": 165, "vllm_target_device": 166, "verbose": 167, "dcmake_verbose_makefile": 168, "dcmake_c_compiler_launcher": 169, "dcmake_cxx_compiler_launcher": 170, "dcmake_cuda_compiler_launcher": 171, "dcmake_hip_compiler_launcher": 172, "elif": 173, "pass": 174, "python": 175, "executable": 176, "can": 177, "find": 178, "exact": 179, "match": 180, "dvllm_python_executable": 181, "reuse": 182, "dependencies": 183, "subsequent": 184, "calls": 185, "dvllm_python_path": 186, "override": 187, "base": 188, "directory": 189, "fetchcontent": 190, "downloads": 191, "root": 192, "deps": 193, "allows": 194, "sharing": 195, "between": 196, "profiles": 197, "plays": 198, "more": 199, "nicely": 200, "fetchcontent_base_dir": 201, "fc_base_dir": 202, "root_dir": 203, "environ": 204, "dfetchcontent_base_dir": 205, "setup": 206, "parallelism": 207, "tool": 208, "num_job": 209, "dnvcc_threads": 210, "build_tool": 211, "dcmake_job_pool_compile": 212, "string": 213, "dcmake_job_pools": 214, "default": 215, "whatever": 216, "picks": 217, "make": 218, "sure": 219, "use": 220, "cuda_home": 221, "dcmake_cuda_compiler": 222, "bin": 223, "subprocess": 224, "check_call": 225, "cwd": 226, "build_temp": 227, "build_extensions": 228, "ensure": 229, "present": 230, "working": 231, "check_output": 232, "oserror": 233, "raise": 234, "runtimeerror": 235, "cannot": 236, "create": 237, "does": 238, "exist": 239, "exists": 240, "makedirs": 241, "targets": 242, "target_name": 243, "removeprefix": 244, "vllm": 245, "vllm_flash_attn": 246, "all": 247, "extensions": 248, "append": 249, "build_args": 250, "target": 251, "install": 252, "libraries": 253, "proper": 254, "location": 255, "outdir": 256, "get_ext_fullpath": 257, "parent": 258, "absolute": 259, "skip": 260, "directo": 261, "ry": 262, "same": 263, "continue": 264, "appends": 265, "prefix": 266, "contains": 267, "need": 268, "remove": 269, "range": 270, "count": 271, "should": 272, "actually": 273, "components": 274, "install_args": 275, "component": 276, "run": 277, "first": 278, "standard": 279, "command": 280, "copy": 281, "py": 282, "build_lib": 283, "current": 284, "included": 285, "editable": 286, "glob": 287, "files": 288, "recursive": 289, "file": 290, "dst_file": 291, "split": 292, "copying": 293, "dirname": 294, "exist_ok": 295, "copy_file": 296, "precompiled_build_ext": 297, "disables": 298, "building": 299, "precompiled": 300, "binaries": 301, "assert": 302, "vllm_use_precompiled": 303, "only": 304, "supported": 305, "builds": 306, "skipping": 307, "precompiled_wheel_utils": 308, "extracts": 309, "other": 310, "existing": 311, "wheel": 312, "staticmethod": 313, "extract_precompiled_and_patch_package": 314, "wheel_url_or_path": 315, "tempfile": 316, "zipfile": 317, "temp_dir": 318, "isfile": 319, "wheel_filename": 320, "mkdtemp": 321, "wheels": 322, "wheel_path": 323, "downloading": 324, "urlretrieve": 325, "filename": 326, "package_data_patch": 327, "files_to_copy": 328, "_c": 329, "abi3": 330, "_moe_c": 331, "_flashmla_c": 332, "_vllm_fa2_c": 333, "_vllm_fa3_c": 334, "cumem_allocator": 335, "compiled_regex": 336, "file_members": 337, "list": 338, "filter": 339, "lambda": 340, "filelist": 341, "extract": 342, "target_path": 343, "target_pa": 344, "th": 345, "open": 346, "src": 347, "wb": 348, "dst": 349, "shutil": 350, "copyfileobj": 351, "pkg": 352, "replace": 353, "setdefault": 354, "basename": 355, "finally": 356, "removing": 357, "temporary": 358, "rmtree": 359, "get_base_commit_in_main_branch": 360, "force": 361, "nightly": 362, "mainly": 363, "used": 364, "ci": 365, "testing": 366, "vllm_test_use_precompiled_nightly_wheel": 367, "latest": 368, "commit": 369, "hash": 370, "upstream": 371, "main": 372, "branch": 373, "resp_json": 374, "curl": 375, "https": 376, "api": 377, "github": 378, "com": 379, "repos": 380, "project": 381, "commits": 382, "decode": 383, "utf": 384, "upstream_main_commit": 385, "json": 386, "loads": 387, "sha": 388, "docker": 389, "context": 390, "git": 391, "may": 392, "immutable": 393, "missing": 394, "vllm_docker_build_context": 395, "check": 396, "local": 397, "repo": 398, "cat": 399, "calledprocesserror": 400, "fetch": 401, "remote": 402, "repository": 403, "update": 404, "any": 405, "branches": 406, "ensures": 407, "ref": 408, "its": 409, "history": 410, "our": 411, "current_branch": 412, "show": 413, "base_commit": 414, "merge": 415, "valueerror": 416, "err": 417, "warning": 418, "failed": 419, "compatible": 420, "your": 421, "dev": 422, "_no_device": 423, "empty": 424, "has_cuda": 425, "_is_neuron": 426, "_is_tpu": 427, "_is_hip": 428, "rocm": 429, "hip": 430, "neuron": 431, "tpu": 432, "_is_cpu": 433, "cpu": 434, "_is_xpu": 435, "xpu": 436, "_build_custom_ops": 437, "get_rocm_version": 438, "rocm_home": 439, "librocm": 440, "core": 441, "see": 442, "blob": 443, "d11f5c20d500f729c393680a01fa902ebf92094b": 444, "rocm_version": 445, "cpp": 446, "l21": 447, "librocm_core_file": 448, "lib": 449, "is_file": 450, "librocm_core": 451, "ctypes": 452, "cdll": 453, "vererrors": 454, "c_uint32": 455, "get_rocm_core_version": 456, "getrocmversion": 457, "restype": 458, "argtypes": 459, "pointer": 460, "major": 461, "minor": 462, "byref": 463, "get_neuronxcc_version": 464, "sysconfig": 465, "site_dir": 466, "get_paths": 467, "purelib": 468, "version_file": 469, "neuronxcc": 470, "executed": 471, "successfully": 472, "fp": 473, "content": 474, "read": 475, "regular": 476, "expression": 477, "search": 478, "__version__": 479, "group": 480, "could": 481, "output": 482, "adapted": 483, "nvidia": 484, "apex": 485, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 486, "nvcc_output": 487, "universal_newlines": 488, "release_idx": 489, "index": 490, "release": 491, "nvcc_cuda_version": 492, "parse": 493, "get_gaudi_sw_version": 494, "returns": 495, "driver": 496, "enable": 497, "console": 498, "printing": 499, "hl": 500, "smi": 501, "shell": 502, "text": 503, "capture_output": 504, "env": 505, "enable_console": 506, "returncode": 507, "stdout": 508, "get_vllm_version": 509, "get_version": 510, "write_to": 511, "_version": 512, "sep": 513, "versions": 514, "might": 515, "contain": 516, "cuda_version": 517, "main_cuda_version": 518, "cuda_version_str": 519, "source": 520, "tarball": 521, "required": 522, "pypi": 523, "sdist": 524, "argv": 525, "cu": 526, "neuron_version": 527, "neuron_version_str": 528, "unknown": 529, "runtime": 530, "get_requirements": 531, "package": 532, "requirements": 533, "requirements_dir": 534, "_read_requirements": 535, "resolved_requirements": 536, "line": 537, "startswith": 538, "common": 539, "cuda_major": 540, "cuda_minor": 541, "modified_requirements": 542, "req": 543, "flash": 544, "attn": 545, "12": 546, "built": 547, "unsupported": 548, "platform": 549, "please": 550, "spdx": 551, "license": 552, "identifier": 553, "apache": 554, "filecopyrighttext": 555, "copyright": 556, "contributors": 557, "requires_files": 558, "pyproject": 559, "toml": 560, "cleaning": 561, "lines": 562, "readlines": 563, "lower": 564, "removed": 565, "write": 566, "done": 567, "requestfuncinput": 568, "prompt": 569, "api_url": 570, "prompt_len": 571, "output_len": 572, "model": 573, "model_name": 574, "optional": 575, "logprobs": 576, "extra_body": 577, "multi_modal_content": 578, "ignore_eos": 579, "language": 580, "requestfuncoutput": 581, "generated_text": 582, "success": 583, "latency": 584, "float": 585, "output_tokens": 586, "ttft": 587, "time": 588, "token": 589, "itl": 590, "field": 591, "default_factory": 592, "inter": 593, "latencies": 594, "tpot": 595, "avg": 596, "next": 597, "async": 598, "async_request_tgi": 599, "request_func_input": 600, "pbar": 601, "tqdm": 602, "endswith": 603, "generate_stream": 604, "aiohttp": 605, "clientsession": 606, "trust_env": 607, "timeout": 608, "aiohttp_timeout": 609, "session": 610, "params": 611, "max_new_tokens": 612, "do_sample": 613, "temperature": 614, "01": 615, "tgi": 616, "accept": 617, "top_p": 618, "99": 619, "truncate": 620, "ignore_eos_token": 621, "payload": 622, "inputs": 623, "parameters": 624, "st": 625, "perf_counter": 626, "most_recent_timestamp": 627, "post": 628, "response": 629, "chunk_bytes": 630, "sometimes": 631, "ping": 632, "without": 633, "data": 634, "chunk": 635, "timestamp": 636, "decoding": 637, "phase": 638, "reason": 639, "exc_info": 640, "format_exception": 641, "async_request_trt_llm": 642, "accumulate_tokens": 643, "text_input": 644, "max_tokens": 645, "stream": 646, "min_length": 647, "text_output": 648, "async_request_deepspeed_mii": 649, "completions": 650, "profile": 651, "openai": 652, "must": 653, "end": 654, "deepspeed": 655, "mii": 656, "temp": 657, "headers": 658, "authorization": 659, "bearer": 660, "openai_api_key": 661, "doesn": 662, "support": 663, "streaming": 664, "jan": 665, "28": 666, "2024": 667, "placeholder": 668, "microsoft": 669, "pull": 670, "311": 671, "parsed_resp": 672, "await": 673, "choices": 674, "unexpected": 675, "neither": 676, "nor": 677, "found": 678, "els": 679, "async_request_openai_completions": 680, "repetition_penalty": 681, "stream_options": 682, "include_usage": 683, "first_chunk_received": 684, "some": 685, "completion": 686, "last": 687, "usage": 688, "summary": 689, "want": 690, "generated": 691, "special": 692, "tokens": 693, "completion_tokens": 694, "never": 695, "received": 696, "valid": 697, "calculate": 698, "marked": 699, "fal": 700, "se": 701, "async_request_openai_chat_completions": 702, "chat": 703, "mm_content": 704, "isinstance": 705, "extend": 706, "typeerror": 707, "messages": 708, "role": 709, "user": 710, "max_completion_tokens": 711, "application": 712, "most_recent_tim": 713, "estamp": 714, "sse": 715, "comments": 716, "often": 717, "pings": 718, "start": 719, "colon": 720, "skipped": 721, "delta": 722, "async_request_openai_audio": 723, "lazy": 724, "placeholdermodule": 725, "dep": 726, "soundfile": 727, "transcriptions": 728, "translations": 729, "en": 730, "flattened": 731, "due": 732, "multipart": 733, "form": 734, "stream_include_usage": 735, "stream_continuous_usage_stats": 736, "send": 737, "audio": 738, "to_bytes": 739, "sr": 740, "buffer": 741, "io": 742, "bytesio": 743, "wav": 744, "seek": 745, "mm_audio": 746, "containing": 747, "formdata": 748, "add_field": 749, "content_type": 750, "key": 751, "items": 752, "get_model": 753, "pretrained_model_name_or_path": 754, "vllm_use_modelscope": 755, "modelscope": 756, "snapshot_download": 757, "model_executor": 758, "model_loader": 759, "weight_utils": 760, "get_lock": 761, "lock": 762, "prevent": 763, "multiple": 764, "processes": 765, "weights": 766, "model_path": 767, "model_id": 768, "local_files_only": 769, "huggingface_hub": 770, "constants": 771, "hf_hub_offline": 772, "ignore_file_pattern": 773, "pt": 774, "safetensors": 775, "get_tokenizer": 776, "tokenizer_mode": 777, "auto": 778, "trust_remote_code": 779, "kwargs": 780, "union": 781, "pretrainedtokenizer": 782, "pretrainedtokenizerfast": 783, "slow": 784, "use_fast": 785, "fast": 786, "tokenizer": 787, "mode": 788, "mistral": 789, "transformers_utils": 790, "mistraltokenizer": 791, "importerror": 792, "requires": 793, "pip": 794, "from_pretrained": 795, "autotokenizer": 796, "args": 797, "rows": 798, "allocate_block": 799, "allocate_blocks": 800, "enforce": 801, "gc": 802, "collect": 803, "ahead": 804, "minimize": 805, "impact": 806, "among": 807, "runs": 808, "block_pool": 809, "blockpool": 810, "num_gpu_blocks": 811, "enable_caching": 812, "get_blocks_times": 813, "timecollector": 814, "us": 815, "free_blocks_times": 816, "num_iteration": 817, "blocks": 818, "get_new_blocks": 819, "free_blocks": 820, "cnt": 821, "dump_avg_max": 822, "tabulate": 823, "iterations": 824, "total": 825, "nblocks": 826, "allocated": 827, "navg": 828, "nmax": 829, "free": 830, "tablefmt": 831, "grid": 832, "floatfmt": 833, "3f": 834, "invoke_main": 835, "parser": 836, "flexibleargumentparser": 837, "description": 838, "benchmark": 839, "performance": 840, "kv": 841, "cache": 842, "add_argument": 843, "num": 844, "gpu": 845, "100000": 846, "iteration": 847, "1000": 848, "help": 849, "stablize": 850, "final": 851, "readings": 852, "allocate": 853, "nargs": 854, "10": 855, "50": 856, "100": 857, "500": 858, "parse_args": 859, "samplerequest": 860, "represents": 861, "inference": 862, "benchmarking": 863, "expected_output_len": 864, "multi_modal_data": 865, "multimodaldatadict": 866, "lora_request": 867, "lorarequest": 868, "benchmarkdataset": 869, "abc": 870, "default_seed": 871, "is_multimodal": 872, "dataset_path": 873, "random_seed": 874, "initialize": 875, "dataset": 876, "random": 877, "seed": 878, "indicates": 879, "reproducible": 880, "shuffling": 881, "sampling": 882, "defaults": 883, "ensuring": 884, "replaced": 885, "apply_multimodal_chat_transformation": 886, "transform": 887, "multimodal": 888, "method": 889, "models": 890, "expect": 891, "specific": 892, "conversation": 893, "load_data": 894, "load": 895, "overridden": 896, "subclasses": 897, "since": 898, "vary": 899, "depending": 900, "raises": 901, "notimplementederror": 902, "subclass": 903, "implement": 904, "todo": 905, "jenniferzhao": 906, "add": 907, "implemented": 908, "get_random_lora_request": 909, "pretrainedtokenizerbase": 910, "max_loras": 911, "option": 912, "al": 913, "lora_path": 914, "tuple": 915, "anytokenizer": 916, "lora": 917, "associated": 918, "provided": 919, "randomly": 920, "selects": 921, "based": 922, "retrieves": 923, "cached": 924, "otherwise": 925, "selected": 926, "maximum": 927, "loras": 928, "disk": 929, "where": 930, "element": 931, "applicable": 932, "second": 933, "generate": 934, "id": 935, "lora_id": 936, "randint": 937, "lora_name": 938, "lora_int_id": 939, "lora_path_on_disk": 940, "lora_tokenizer_cache": 941, "get_lora_tokenizer": 942, "abstractmethod": 943, "sample": 944, "num_requests": 945, "abstract": 946, "requests": 947, "subcl": 948, "asses": 949, "logic": 950, "generating": 951, "objects": 952, "processing": 953, "maybe_oversample_requests": 954, "oversamples": 955, "size": 956, "less": 957, "than": 958, "desired": 959, "sampled": 960, "additional": 961, "oversampled": 962, "reach": 963, "samples": 964, "is_valid_sequence": 965, "min_len": 966, "max_prompt_len": 967, "1024": 968, "max_total_len": 969, "2048": 970, "skip_min_output_len_check": 971, "validate": 972, "sequence": 973, "lengths": 974, "pruning": 975, "criteria": 976, "copied": 977, "original": 978, "sample_hf_requests": 979, "sample_sharegpt_requests": 980, "functions": 981, "benchmark_serving": 982, "well": 983, "sample_requests": 984, "benchmark_throughput": 985, "invalid": 986, "conditions": 987, "prompt_too_short": 988, "output_too_short": 989, "prompt_too_long": 990, "combined_too_long": 991, "met": 992, "get_adapter_absolute_path": 993, "process_image": 994, "image": 995, "mapping": 996, "process": 997, "input": 998, "multimedia": 999, "dictionary": 1000, "supports": 1001, "three": 1002, "types": 1003, "raw": 1004, "bytes": 1005, "expects": 1006, "pil": 1007, "converts": 1008, "rgb": 1009, "saves": 1010, "jpeg": 1011, "memory": 1012, "encodes": 1013, "base64": 1014, "treats": 1015, "prepends": 1016, "http": 1017, "convert_image_mode": 1018, "image_data": 1019, "save": 1020, "image_base64": 1021, "b64encode": 1022, "getvalue": 1023, "image_url": 1024, "randomdataset": 1025, "values": 1026, "default_prefix_len": 1027, "default_range_ratio": 1028, "default_input_len": 1029, "default_output_len": 1030, "128": 1031, "prefix_len": 1032, "range_ratio": 1033, "input_len": 1034, "random_range_ratio": 1035, "vocab_size": 1036, "num_special_tokens": 1037, "num_special_tokens_to_add": 1038, "real_input_len": 1039, "prefix_token_ids": 1040, "np": 1041, "tolist": 1042, "new": 1043, "input_low": 1044, "input_high": 1045, "output_low": 1046, "bound": 1047, "length": 1048, "least": 1049, "cause": 1050, "failures": 1051, "output_high": 1052, "logging": 1053, "debugging": 1054, "input_lens": 1055, "output_lens": 1056, "offsets": 1057, "inner_seq": 1058, "arange": 1059, "token_sequence": 1060, "after": 1061, "encode": 1062, "again": 1063, "because": 1064, "cases": 1065, "consecutive": 1066, "give": 1067, "tokenized": 1068, "example": 1069, "gpt2tokenizer": 1070, "6880": 1071, "6881": 1072, "ġcalls": 1073, "1650": 1074, "939": 1075, "486": 1076, "ġcall": 1077, "sh": 1078, "ere": 1079, "uncontrolled": 1080, "change": 1081, "encoded": 1082, "truncated": 1083, "before": 1084, "being": 1085, "total_input_len": 1086, "re_encoded_sequence": 1087, "add_special_tokens": 1088, "sharegptdataset": 1089, "implements": 1090, "sharegpt": 1091, "generates": 1092, "turns": 1093, "loading": 1094, "encoding": 1095, "entries": 1096, "two": 1097, "entry": 1098, "conversations": 1099, "shuffle": 1100, "enable_multimodal_chat": 1101, "break": 1102, "prompt_ids": 1103, "input_ids": 1104, "completion_ids": 1105, "new_output_len": 1106, "also": 1107, "sharegpt4video": 1108, "image_path": 1109, "customdataset": 1110, "custom": 1111, "jsonl": 1112, "what": 1113, "capital": 1114, "india": 1115, "iran": 1116, "china": 1117, "dictionaries": 1118, "standardized": 1119, "has": 1120, "convert": 1121, "filetype": 1122, "assume": 1123, "jsonl_data": 1124, "pd": 1125, "read_json": 1126, "path_or_buf": 1127, "column": 1128, "columns": 1129, "each": 1130, "row": 1131, "dataframe": 1132, "corresponds": 1133, "iterrows": 1134, "to_dict": 1135, "skip_chat_template": 1136, "sampled_requests": 1137, "item": 1138, "apply": 1139, "template": 1140, "apply_chat_template": 1141, "add_generation_prompt": 1142, "tokenize": 1143, "sonnetdataset": 1144, "simplified": 1145, "implementation": 1146, "sonnet": 1147, "poem": 1148, "550": 1149, "150": 1150, "return_prompt_formatted": 1151, "average": 1152, "tokenized_lines": 1153, "avg_len": 1154, "sum": 1155, "base_prompt": 1156, "pick": 1157, "many": 1158, "you": 1159, "base_msg": 1160, "base_fmt": 1161, "base_offset": 1162, "higher": 1163, "num_input_lines": 1164, "round": 1165, "num_prefix_lines": 1166, "prefix_lines": 1167, "while": 1168, "extra_lines": 1169, "msg": 1170, "prompt_formatted": 1171, "burstgptdataset": 1172, "burstgpt": 1173, "csv": 1174, "synthetic": 1175, "generation": 1176, "gpt": 1177, "positive": 1178, "df": 1179, "read_csv": 1180, "keep": 1181, "gpt4_df": 1182, "_sample_loaded_data": 1183, "random_state": 1184, "lists": 1185, "lora_req": 1186, "ist": 1187, "ids": 1188, "computed": 1189, "modulo": 1190, "token_ids": 1191, "huggingfacedataset": 1192, "datasets": 1193, "hosted": 1194, "huggingface": 1195, "supported_dataset_paths": 1196, "dataset_split": 1197, "no_stream": 1198, "dataset_subset": 1199, "load_stream": 1200, "load_dataset": 1201, "conversationdataset": 1202, "lmms": 1203, "lab": 1204, "llava": 1205, "onevision": 1206, "aeala": 1207, "sharegpt_vicuna_unfiltered": 1208, "examples": 1209, "filtered_data": 1210, "dynamic_output": 1211, "conv": 1212, "completion_len": 1213, "enabled": 1214, "longer": 1215, "accurate": 1216, "actual": 1217, "visionarenadataset": 1218, "vision": 1219, "arena": 1220, "lmarena": 1221, "ai": 1222, "visionarena": 1223, "bench": 1224, "v0": 1225, "parser_fn": 1226, "images": 1227, "instructcoderdataset": 1228, "instructcoder": 1229, "co": 1230, "likaixin": 1231, "designed": 1232, "general": 1233, "code": 1234, "editing": 1235, "consists": 1236, "114": 1237, "239": 1238, "instruction": 1239, "triplets": 1240, "covers": 1241, "distinct": 1242, "scenario": 1243, "just": 1244, "do": 1245, "include": 1246, "explanation": 1247, "mtbenchdataset": 1248, "mt": 1249, "philschmid": 1250, "turn": 1251, "similar": 1252, "9d98ab5ec": 1253, "offline_inference": 1254, "eagle": 1255, "l14": 1256, "l18": 1257, "noqa": 1258, "e501": 1259, "256": 1260, "sd": 1261, "aimodataset": 1262, "aimo": 1263, "reasoning": 1264, "questions": 1265, "mo": 1266, "validation": 1267, "aime": 1268, "numinamath": 1269, "cot": 1270, "problem": 1271, "solution": 1272, "32000": 1273, "_format_zeta_prompt": 1274, "original_start_marker": 1275, "editable_region_start": 1276, "zeta": 1277, "edit": 1278, "prediction": 1279, "nep": 1280, "formats": 1281, "prompts": 1282, "expected": 1283, "outputs": 1284, "further": 1285, "extended": 1286, "events": 1287, "marker": 1288, "indicating": 1289, "region": 1290, "formatted": 1291, "zeta_prompt": 1292, "following": 1293, "focused": 1294, "output_start_index": 1295, "output_focused_region": 1296, "expected_output": 1297, "nexteditpredictiondataset": 1298, "zed": 1299, "industries": 1300, "mapping_prompt_funcs": 1301, "formatting_prompt_func": 1302, "asrdataset": 1303, "asr": 1304, "transcription": 1305, "tested": 1306, "domain": 1307, "speaking": 1308, "style": 1309, "hf": 1310, "subset": 1311, "ted": 1312, "lium": 1313, "talks": 1314, "oratory": 1315, "release1": 1316, "release2": 1317, "release3": 1318, "speaker": 1319, "adaptation": 1320, "voxpopuli": 1321, "european": 1322, "parliament": 1323, "de": 1324, "fr": 1325, "librispeech": 1326, "audiobook": 1327, "narrated": 1328, "tedlium": 1329, "gigaspeech": 1330, "podcast": 1331, "youtube": 1332, "spontaneous": 1333, "xs": 1334, "xl": 1335, "test": 1336, "spgispeech": 1337, "financial": 1338, "meetings": 1339, "ami": 1340, "ihm": 1341, "sdm": 1342, "openslr": 1343, "librispeech_asr": 1344, "facebook": 1345, "edinburghcstr": 1346, "speechcolab": 1347, "kensho": 1348, "whisper": 1349, "interface": 1350, "transcription_preamble": 1351, "startoftranscript": 1352, "transcribe": 1353, "notimestamps": 1354, "skip_long_audios": 1355, "librosa": 1356, "array": 1357, "sampling_rate": 1358, "duration_s": 1359, "get_duration": 1360, "duration": 1361, "30": 1362, "discarded": 1363, "greater": 1364, "save_to_pytorch_benchmark_format": 1365, "argparse": 1366, "namespace": 1367, "results": 1368, "pt_records": 1369, "convert_to_pytorch_benchmark_format": 1370, "metrics": 1371, "extra_info": 1372, "avg_latency": 1373, "percentiles": 1374, "pt_file": 1375, "splitext": 1376, "output_json": 1377, "pytorch": 1378, "write_to_json": 1379, "engine_args": 1380, "engineargs": 1381, "from_cli_args": 1382, "woosuk": 1383, "processed": 1384, "batch": 1385, "engine": 1386, "automatically": 1387, "batches": 1388, "llm": 1389, "dataclasses": 1390, "asdict": 1391, "llm_engine": 1392, "model_config": 1393, "max_model_len": 1394, "sampling_params": 1395, "samplingparams": 1396, "detokenize": 1397, "disable_detokenize": 1398, "dummy_prompt_token_ids": 1399, "10000": 1400, "batch_size": 1401, "dummy_prompts": 1402, "prompttype": 1403, "prompt_token_ids": 1404, "llm_generate": 1405, "use_beam_search": 1406, "use_tqdm": 1407, "beam_search": 1408, "beamsearchparams": 1409, "beam_width": 1410, "run_to_completion": 1411, "profile_dir": 1412, "start_profile": 1413, "stop_profile": 1414, "start_time": 1415, "end_time": 1416, "warming": 1417, "up": 1418, "num_iters_warmup": 1419, "desc": 1420, "warmup": 1421, "vllm_torc": 1422, "h_profiler_dir": 1423, "profiling": 1424, "saved": 1425, "num_iters": 1426, "percentages": 1427, "25": 1428, "75": 1429, "90": 1430, "percentile": 1431, "mean": 1432, "seconds": 1433, "percentage": 1434, "zip": 1435, "specified": 1436, "dump": 1437, "indent": 1438, "create_argument_parser": 1439, "till": 1440, "32": 1441, "sequences": 1442, "per": 1443, "beam": 1444, "action": 1445, "store_true": 1446, "iters": 1447, "disable": 1448, "responses": 1449, "detokenization": 1450, "measurement": 1451, "add_cli_args": 1452, "v1": 1453, "enables": 1454, "caching": 1455, "skews": 1456, "numbers": 1457, "set_defaults": 1458, "enable_prefix_caching": 1459, "test_long_document_qa": 1460, "long": 1461, "document": 1462, "qa": 1463, "given": 1464, "spent": 1465, "parameter": 1466, "strings": 1467, "execute": 1468, "4f": 1469, "secs": 1470, "repeat_prompts": 1471, "repeat_count": 1472, "repeat": 1473, "times": 1474, "order": 1475, "depends": 1476, "repeated": 1477, "repetition": 1478, "modes": 1479, "tile": 1480, "entire": 1481, "interleave": 1482, "consecutively": 1483, "moving": 1484, "repeated_prompts": 1485, "shuffle_seed": 1486, "prepare": 1487, "beginning": 1488, "documents": 1489, "hi": 1490, "document_length": 1491, "num_documents": 1492, "repeat_mode": 1493, "warmup_prompts": 1494, "warm": 1495, "automatic": 1496, "roughly": 1497, "paper": 1498, "excluding": 1499, "20000": 1500, "min": 1501, "details": 1502, "max_ngram": 1503, "collector": 1504, "modelconfig": 1505, "opt": 1506, "125m": 1507, "task": 1508, "num_token": 1509, "num_spec_token": 1510, "dtype": 1511, "proposer": 1512, "ngramproposer": 1513, "vllm_config": 1514, "vllmconfig": 1515, "speculative_config": 1516, "speculativeconfig": 1517, "prompt_lookup_min": 1518, "min_ngram": 1519, "prompt_lookup_max": 1520, "num_speculative_tokens": 1521, "ngram": 1522, "propose": 1523, "20": 1524, "num_req": 1525, "gram": 1526, "speculative": 1527, "drafting": 1528, "1500": 1529, "minimum": 1530, "15": 1531, "test_prefix": 1532, "cost": 1533, "sample_tokens": 1534, "vocab": 1535, "get_vocab": 1536, "all_special_ids": 1537, "sample_requests_from_dataset": 1538, "input_length_range": 1539, "fixed_output_len": 1540, "too": 1541, "small": 1542, "out": 1543, "max_len": 1544, "short": 1545, "filtered_requests": 1546, "completion_token_ids": 1547, "sample_requests_from_random": 1548, "unique_part_token_ids": 1549, "repeat_and_sort_requests": 1550, "sort": 1551, "repeated_requests": 1552, "map": 1553, "num_prompts": 1554, "helpful": 1555, "stats": 1556, "prompt_lens": 1557, "p50": 1558, "sorted": 1559, "filtered": 1560, "test_": 1561, "specifies": 1562, "added": 1563, "subtract": 1564, "filtering": 1565, "get_random_flag": 1566, "filtered_dataset": 1567, "prune": 1568, "priority": 1569, "run_vllm": 1570, "_priority": 1571, "synthesize": 1572, "backend": 1573, "elapsed_time": 1574, "total_num_tokens": 1575, "throughput": 1576, "2f": 1577, "requests_per_second": 1578, "tokens_per_second": 1579, "overrides": 1580, "benchmarkmetrics": 1581, "completed": 1582, "total_input": 1583, "total_output": 1584, "request_throughput": 1585, "request_goodput": 1586, "output_throughput": 1587, "total_token_throughput": 1588, "mean_ttft_ms": 1589, "median_ttft_ms": 1590, "std_ttft_ms": 1591, "percentiles_ttft_ms": 1592, "mean_tpot_ms": 1593, "median_tpot_ms": 1594, "std_tpot_ms": 1595, "percentiles_tpot_ms": 1596, "mean_itl_ms": 1597, "median_itl_ms": 1598, "std_itl_ms": 1599, "percentiles_itl_ms": 1600, "e2el": 1601, "stands": 1602, "taken": 1603, "client": 1604, "side": 1605, "sending": 1606, "receiving": 1607, "complete": 1608, "mean_e2el_ms": 1609, "median_e2el_ms": 1610, "std_e2el_ms": 1611, "percentiles_e2el_ms": 1612, "calculate_metrics": 1613, "input_requests": 1614, "dur_s": 1615, "selected_percentile_metrics": 1616, "selected_percentiles": 1617, "goodput_config_dict": 1618, "actual_output_lens": 1619, "good_completed": 1620, "itls": 1621, "tpots": 1622, "all_tpots": 1623, "ttfts": 1624, "e2els": 1625, "serving": 1626, "backends": 1627, "instead": 1628, "looking": 1629, "bundled": 1630, "together": 1631, "inflate": 1632, "slightly": 1633, "latency_minus_ttft": 1634, "regard": 1635, "goodput": 1636, "valid_metrics": 1637, "slo_values": 1638, "milliseconds_to_seconds_conversion": 1639, "req_metric": 1640, "is_good_req": 1641, "warnings": 1642, "warn": 1643, "likely": 1644, "misconfiguration": 1645, "arguments": 1646, "stacklevel": 1647, "std": 1648, "median": 1649, "base_url": 1650, "request_rate": 1651, "burstiness": 1652, "disable_tqdm": 1653, "max_concurrency": 1654, "lora_modules": 1655, "iterable": 1656, "ramp_up_strategy": 1657, "literal": 1658, "linear": 1659, "exponential": 1660, "ramp_up_start_rps": 1661, "ramp_up_end_rps": 1662, "async_request_funcs": 1663, "request_func": 1664, "starting": 1665, "initial": 1666, "test_prompt": 1667, "test_prompt_len": 1668, "test_output_len": 1669, "test_mm_content": 1670, "test_input": 1671, "test_output": 1672, "correctly": 1673, "choose": 1674, "iter": 1675, "choice": 1676, "profiler": 1677, "profile_input": 1678, "profile_output": 1679, "started": 1680, "distribution": 1681, "poisson": 1682, "gamma": 1683, "traffic": 1684, "ramp": 1685, "strategy": 1686, "increase": 1687, "rps": 1688, "over": 1689, "rate": 1690, "factor": 1691, "concurrency": 1692, "once": 1693, "simplify": 1694, "limited_request_func": 1695, "semaphore": 1696, "asyncio": 1697, "contextlib": 1698, "nullcontext": 1699, "benchmark_start_time": 1700, "tasks": 1701, "rps_change_events": 1702, "last_int_rps": 1703, "datetime": 1704, "now": 1705, "isoformat": 1706, "current_request_rate": 1707, "get_request": 1708, "current_int_rps": 1709, "rps_val": 1710, "req_model_id": 1711, "req_model_name": 1712, "req_lora_module": 1713, "ogprobs": 1714, "create_task": 1715, "gather": 1716, "close": 1717, "benchmark_duration": 1718, "result": 1719, "40": 1720, "successful": 1721, "inf": 1722, "tok": 1723, "metr": 1724, "ics": 1725, "total_input_tokens": 1726, "total_output_tokens": 1727, "generated_texts": 1728, "process_one_metric": 1729, "metric_attribute_name": 1730, "metric_name": 1731, "metric_header": 1732, "adds": 1733, "statistics": 1734, "metric": 1735, "ms": 1736, "getattr": 1737, "mean_": 1738, "_ms": 1739, "median_": 1740, "medi": 1741, "an_": 1742, "std_": 1743, "percentiles_": 1744, "p_word": 1745, "excl": 1746, "1st": 1747, "stopping": 1748, "stopped": 1749, "check_goodput_args": 1750, "valid_names": 1751, "parse_goodput": 1752, "slo_name": 1753, "slo_val": 1754, "service": 1755, "objective": 1756, "one": 1757, "non": 1758, "negative": 1759, "slo_pairs": 1760, "slo_pair": 1761, "argumenttypeerror": 1762, "objectives": 1763, "specify": 1764, "pairs": 1765, "milliseconds": 1766, "file_name": 1767, "p99_ttft_ms": 1768, "p99_tpot_ms": 1769, "p99_itl_ms": 1770, "useful": 1771, "rather": 1772, "big": 1773, "later": 1774, "needed": 1775, "ignored_metrics": 1776, "don": 1777, "suffix": 1778, "served_model_name": 1779, "tokenizer_id": 1780, "controlled": 1781, "argument": 1782, "both": 1783, "endpoint": 1784, "host": 1785, "port": 1786, "dataset_name": 1787, "corresponding": 1788, "ataset_name": 1789, "custom_output_len": 1790, "custom_skip_chat_template": 1791, "formatting": 1792, "sonnet_input_len": 1793, "sonnet_output_len": 1794, "sonnet_prefix_len": 1795, "chat_template": 1796, "default_chat_template": 1797, "dataset_class": 1798, "hf_split": 1799, "train": 1800, "hf_subset": 1801, "dataset_c": 1802, "lass": 1803, "supported_datasets": 1804, "cls": 1805, "__subclasses__": 1806, "consider": 1807, "contributing": 1808, "would": 1809, "like": 1810, "multi": 1811, "modal": 1812, "hf_output_len": 1813, "follow": 1814, "structure": 1815, "dataset_mapping": 1816, "sharegpt_output_len": 1817, "random_prefix_len": 1818, "random_input_len": 1819, "random_output_len": 1820, "keyerror": 1821, "top_k": 1822, "min_p": 1823, "openai_compatible_backends": 1824, "greedy": 1825, "ackend": 1826, "llama": 1827, "cache_prompt": 1828, "static": 1829, "pause": 1830, "freeze": 1831, "benchmark_result": 1832, "percentile_metrics": 1833, "metric_percentiles": 1834, "config": 1835, "save_result": 1836, "append_result": 1837, "result_json": 1838, "current_dt": 1839, "strftime": 1840, "date": 1841, "metadata": 1842, "kvstring": 1843, "valueer": 1844, "ror": 1845, "save_detailed": 1846, "fields": 1847, "points": 1848, "del": 1849, "base_model_id": 1850, "max_concurrency_str": 1851, "qps": 1852, "result_filename": 1853, "result_dir": 1854, "outfile": 1855, "newline": 1856, "tell": 1857, "online": 1858, "keys": 1859, "server": 1860, "127": 1861, "localhost": 1862, "ipv4": 1863, "8000": 1864, "concurrent": 1865, "simulate": 1866, "enforcing": 1867, "controls": 1868, "initiated": 1869, "control": 1870, "allowed": 1871, "means": 1872, "combination": 1873, "enough": 1874, "compute": 1875, "part": 1876, "unspecified": 1877, "disabled": 1878, "dummy": 1879, "logprob": 1880, "returned": 1881, "sent": 1882, "arrival": 1883, "take": 1884, "effect": 1885, "follows": 1886, "intervals": 1887, "bursty": 1888, "uniform": 1889, "arser": 1890, "trust": 1891, "progress": 1892, "bar": 1893, "launched": 1894, "vllm_torch_profiler_dir": 1895, "detailed": 1896, "saving": 1897, "whether": 1898, "information": 1899, "ttfs": 1900, "etc": 1901, "metavar": 1902, "tp": 1903, "record": 1904, "keeping": 1905, "purposes": 1906, "dir": 1907, "ignore": 1908, "eos": 1909, "flag": 1910, "deepspeed_mii": 1911, "comma": 1912, "separated": 1913, "report": 1914, "percentils": 1915, "names": 1916, "spaces": 1917, "definition": 1918, "refer": 1919, "distserve": 1920, "arxiv": 1921, "org": 1922, "pdf": 1923, "2401": 1924, "09670": 1925, "blog": 1926, "hao": 1927, "blogs": 1928, "custom_group": 1929, "add_argument_group": 1930, "options": 1931, "applying": 1932, "sonnet_group": 1933, "sharegpt_group": 1934, "random_group": 1935, "ratio": 1936, "define": 1937, "symmetric": 1938, "fixed": 1939, "om": 1940, "hf_group": 1941, "sampling_group": 1942, "top": 1943, "always": 1944, "mistral_common": 1945, "preregistered": 1946, "served": 1947, "passed": 1948, "launching": 1949, "script": 1950, "chooses": 1951, "needs": 1952, "ending": 1953, "representing": 1954, "attributes": 1955, "schema": 1956, "structure_type": 1957, "unique": 1958, "json_schema_path": 1959, "dir_path": 1960, "realpath": 1961, "__file__": 1962, "structured_schemas": 1963, "structured_schema_1": 1964, "json_schemas": 1965, "deepcopy": 1966, "properties": 1967, "__optional_field_": 1968, "uuid": 1969, "uuid4": 1970, "schemas": 1971, "gen_prompt": 1972, "brief": 1973, "dumps": 1974, "get_schema": 1975, "grammar": 1976, "select_statement": 1977, "table": 1978, "condition": 1979, "col_1": 1980, "col_2": 1981, "table_1": 1982, "table_2": 1983, "sql": 1984, "query": 1985, "username": 1986, "email": 1987, "users": 1988, "regex": 1989, "address": 1990, "alan": 1991, "turing": 1992, "who": 1993, "works": 1994, "enigma": 1995, "classify": 1996, "sentiment": 1997, "wonderful": 1998, "datas": 1999, "et": 2000, "xgrammar_bench": 2001, "nousresearch": 2002, "eval": 2003, "full_dataset_len": 2004, "_filter_func": 2005, "has_xgrammar_unsupported_json_features": 2006, "num_filtered_out": 2007, "features": 2008, "len_dataset": 2009, "data_point_idx": 2010, "idx": 2011, "asyncgenerator": 2012, "asynchronously": 2013, "represented": 2014, "takes": 2015, "scale": 2016, "theta": 2017, "maintain": 2018, "enumerate": 2019, "yield": 2020, "infinity": 2021, "wait": 2022, "interval": 2023, "shape": 2024, "sleep": 2025, "mill": 2026, "iseconds_to_seconds_conversion": 2027, "centiles_itl_ms": 2028, "structured_output_ratio": 2029, "prepare_extra_body": 2030, "structured_output_req_idx": 2031, "test_request": 2032, "test_req_extra_body": 2033, "ttft_description": 2034, "series": 2035, "describe": 2036, "tpot_description": 2037, "ret": 2038, "gt": 2039, "evaluate": 2040, "_eval_correctness_json": 2041, "_eval_correctness_choice": 2042, "_eval_correctness_regex": 2043, "_eval_correctness": 2044, "guided_json": 2045, "guided_regex": 2046, "guided_choice": 2047, "scores": 2048, "res": 2049, "score": 2050, "correctness": 2051, "not_none_scores": 2052, "guided_grammar": 2053, "no_structured_output": 2054, "save_results": 2055, "result_file_name": 2056, "guided": 2057, "_out": 2058, "correct_rate": 2059, "he": 2060, "lp": 2061, "structured": 2062, "requestoutput": 2063, "textprompt": 2064, "tokensprompt": 2065, "lora_requests": 2066, "enable_lora": 2067, "beamsearch": 2068, "run_vllm_chat": 2069, "recommended": 2070, "properly": 2071, "handles": 2072, "run_vllm_async": 2073, "asyncengineargs": 2074, "disable_frontend_multiprocessing": 2075, "build_async_engine_client_from_engine_args": 2076, "get_model_config": 2077, "generators": 2078, "sp": 2079, "lr": 2080, "sampling_param": 2081, "generator": 2082, "request_id": 2083, "all_gens": 2084, "merge_async_iterators": 2085, "run_hf": 2086, "max_batch_size": 2087, "automodelforcausallm": 2088, "torch_dtype": 2089, "float16": 2090, "model_type": 2091, "padding": 2092, "pad_token": 2093, "eos_token": 2094, "max_output_len": 2095, "next_prompt_len": 2096, "next_output_len": 2097, "return_tensors": 2098, "llm_outputs": 2099, "num_return_sequences": 2100, "use_cache": 2101, "batch_decode": 2102, "sk": 2103, "ip_special_tokens": 2104, "clear": 2105, "run_mii": 2106, "tensor_parallel_size": 2107, "serve": 2108, "tensor_parallel": 2109, "terminate_server": 2110, "get_requests": 2111, "common_kwargs": 2112, "sample_kwargs": 2113, "dataset_cls": 2114, "hf_sub": 2115, "is_multi_modal": 2116, "request_outputs": 2117, "async_engine": 2118, "uvloop": 2119, "hf_max_batch_size": 2120, "total_prompt_tokens": 2121, "ro": 2122, "033": 2123, "91mwarning": 2124, "0m": 2125, "detected": 2126, "counted": 2127, "issues": 2128, "9778": 2129, "counts": 2130, "validate_args": 2131, "deprecation": 2132, "defaulting": 2133, "deprecated": 2134, "valid_backends": 2135, "checks": 2136, "ignored": 2137, "vll": 2138, "settings": 2139, "validations": 2140, "quantization": 2141, "parallel": 2142, "currently": 2143, "16222": 2144, "data_parallel_size": 2145, "offline": 2146, "prompt_or_response": 2147, "ync": 2148, "frontend": 2149, "multiprocessing": 2150, "decoupled": 2151, "adapters": 2152, "relative": 2153, "hugging": 2154, "face": 2155, "much": 2156, "versus": 2157, "remains": 2158, "approximately": 2159, "dtaset": 2160, "oss": 2161, "wiki": 2162, "integrate": 2163, "database": 2164, "records": 2165, "benchmark_values": 2166, "vars": 2167, "infencoder": 2168, "jsonencoder": 2169, "clear_inf": 2170, "math": 2171, "isinf": 2172, "iterencode": 2173, "__name__": 2174, "serializable": 2175, "ns": 2176, "_sum": 2177, "_max": 2178, "monotonic_ns": 2179, "__enter__": 2180, "__exit__": 2181, "exc_type": 2182, "baseexception": 2183, "exc_value": 2184, "exc_traceback": 2185, "tracebacktype": 2186, "usr": 2187, "python3": 2188, "running": 2189, "hipify": 2190, "preprocessor": 2191, "hipify_torch": 2192, "utils": 2193, "hipify_python": 2194, "__main__": 2195, "argumentparser": 2196, "live": 2197, "project_dir": 2198, "hipified": 2199, "written": 2200, "output_dir": 2201, "limit": 2202, "scope": 2203, "includes": 2204, "extra_files": 2205, "hold": 2206, "copytree": 2207, "dirs_exist_ok": 2208, "hipify_result": 2209, "project_directory": 2210, "output_directory": 2211, "header_include_dirs": 2212, "show_detailed": 2213, "is_pytorch_extension": 2214, "hipify_extra_files_only": 2215, "hipified_sources": 2216, "s_abs": 2217, "hipified_s_abs": 2218, "hipified_path": 2219, "cython": 2220, "compiler": 2221, "cythonize": 2222, "setuptools": 2223, "annotate": 2224, "infiles": 2225, "detokenizer": 2226, "output_processor": 2227, "single_step": 2228, "stop_checker": 2229, "scheduler": 2230, "block_manager": 2231, "layers": 2232, "sampler": 2233, "ext_modules": 2234, "compiler_directives": 2235, "language_level": 2236, "infer_types": 2237, "build_cython": 2238, "inplace": 2239, "_read_prompts": 2240, "imageassetprompts": 2241, "typeddict": 2242, "stop_sign": 2243, "cherry_blossom": 2244, "imagetestassets": 2245, "imageasset": 2246, "convenience": 2247, "matches": 2248, "assets": 2249, "iterating": 2250, "through": 2251, "videoassetprompts": 2252, "baby_reading": 2253, "videotestassets": 2254, "videoasset": 2255, "audioassetprompts": 2256, "mary_had_lamb": 2257, "winning_call": 2258, "audiotestassets": 2259, "audioasset": 2260, "cleanup_vllm_use_v1": 2261, "monkeypatch": 2262, "oracle": 2263, "sets": 2264, "vllm_use_v1": 2265, "during": 2266, "invocation": 2267, "touch": 2268, "changes": 2269, "made": 2270, "cleaned": 2271, "fixture": 2272, "every": 2273, "delete": 2274, "clean": 2275, "upon": 2276, "modifies": 2277, "setenv": 2278, "delenv": 2279, "run_with_both_engines": 2280, "tests": 2281, "twice": 2282, "use_v1": 2283, "param": 2284, "decorated": 2285, "skip_v1": 2286, "skip_v0": 2287, "node": 2288, "get_closest_marker": 2289, "pytest": 2290, "init_test_http_connection": 2291, "pytest_asyncio": 2292, "different": 2293, "event": 2294, "loop": 2295, "created": 2296, "anew": 2297, "global_http_connection": 2298, "reuse_client": 2299, "dist_init": 2300, "temp_file": 2301, "mkstemp": 2302, "init_distributed_environment": 2303, "world_size": 2304, "rank": 2305, "distributed_init_method": 2306, "local_rank": 2307, "nccl": 2308, "initialize_model_parallel": 2309, "cleanup_dist_env_and_memory": 2310, "should_do_global_cleanup_after_test": 2311, "allow": 2312, "subdirectories": 2313, "global": 2314, "cleanup": 2315, "overriding": 2316, "provide": 2317, "10x": 2318, "speedup": 2319, "unit": 2320, "skip_global_cleanup": 2321, "cleanup_fixture": 2322, "dynamo_reset": 2323, "_dynamo": 2324, "reset": 2325, "example_prompts": 2326, "_test_prompts": 2327, "example_system_message": 2328, "_sys_msg": 2329, "decoderprompttype": 2330, "enum": 2331, "encoder": 2332, "decoder": 2333, "empty_str": 2334, "example_encoder_decoder_prompts": 2335, "explicitencoderdecoderprompt": 2336, "wherein": 2337, "pair": 2338, "reverse": 2339, "encoder_prompts": 2340, "custom_decoder_prompts": 2341, "empty_str_decoder_prompts": 2342, "none_decoder_prompts": 2343, "zip_enc_dec_prompts": 2344, "example_long_prompts": 2345, "_long_prompts": 2346, "image_assets": 2347, "video_assets": 2348, "audio_assets": 2349, "hfrunner": 2350, "get_default_device": 2351, "platforms": 2352, "current_platform": 2353, "is_cpu": 2354, "device_type": 2355, "wrap_device": 2356, "_t": 2357, "device": 2358, "hasattr": 2359, "model_kwargs": 2360, "is_sentence_transformer": 2361, "is_cross_encoder": 2362, "skip_tokenizer_init": 2363, "auto_cls": 2364, "_baseautomodelclass": 2365, "maybe_model_redirect": 2366, "autoconfig": 2367, "_get_and_verify_dtype": 2368, "is_pooling_model": 2369, "init": 2370, "amd": 2371, "sentence_transformers": 2372, "sentencetransformer": 2373, "_remote_code": 2374, "crossencoder": 2375, "automodel_args": 2376, "case": 2377, "unquantized": 2378, "quantization_method": 2379, "bitsandbytes": 2380, "put": 2381, "call": 2382, "device_count": 2383, "transformers": 2384, "autoprocessor": 2385, "f401": 2386, "processor": 2387, "get_inputs": 2388, "promptimageinput": 2389, "videos": 2390, "promptvideoinput": 2391, "audios": 2392, "promptaudioinput": 2393, "batchfeature": 2394, "batchencoding": 2395, "all_inputs": 2396, "processor_kwargs": 2397, "video": 2398, "audio_inputs": 2399, "hack": 2400, "processors": 2401, "future": 2402, "get_prompt_embeddings": 2403, "tensor": 2404, "embeddings": 2405, "embedding": 2406, "get_input_embeddings": 2407, "squeeze": 2408, "logits": 2409, "softmax": 2410, "dim": 2411, "output_ids": 2412, "output_str": 2413, "skip_special_tokens": 2414, "clean_up_tokenization_spaces": 2415, "generate_greedy": 2416, "generate_beam_search": 2417, "num_beams": 2418, "pad_token_id": 2419, "generate_greedy_logprobs": 2420, "all_logprobs": 2421, "output_hidden_states": 2422, "return_dict_in_generate": 2423, "seq_logprobs": 2424, "_hidden_states_to_seq_logprobs": 2425, "hidden_states": 2426, "output_embeddings": 2427, "get_output_embeddings": 2428, "hidden_state": 2429, "last_hidden_states": 2430, "matmul": 2431, "weight": 2432, "bias": 2433, "unsqueeze": 2434, "log_softmax": 2435, "float32": 2436, "_hidden_states_to_logprobs": 2437, "num_logprobs": 2438, "seq_logprobs_lst": 2439, "tok_idx": 2440, "tok_logprobs": 2441, "drop": 2442, "reshape": 2443, "topk": 2444, "tok_logprobs_dct": 2445, "token_id": 2446, "indices": 2447, "_lst": 2448, "generate_greedy_logprobs_limit": 2449, "tokenstextlogprobs": 2450, "all_output_ids": 2451, "all_output_strs": 2452, "seq_ids": 2453, "output_logprobs": 2454, "generate_encoder_decoder_greedy_logprobs_limit": 2455, "encoder_decoder_prompts": 2456, "expliciten": 2457, "coderdecoderprompt": 2458, "encoder_prompt": 2459, "decoder_prompt": 2460, "to_enc_dec_tuple_list": 2461, "encoder_inputs": 2462, "decoder_input_ids": 2463, "decoder_inputs": 2464, "decoder_hidden_states": 2465, "predict": 2466, "convert_to_tensor": 2467, "hf_runner": 2468, "vllmrunner": 2469, "modified": 2470, "reproducibility": 2471, "block_size": 2472, "64": 2473, "devices": 2474, "16": 2475, "enable_chunked_prefill": 2476, "enforce_eager": 2477, "graph": 2478, "runner": 2479, "runneroption": 2480, "convertoption": 2481, "tokenizer_name": 2482, "disable_log_stats": 2483, "is_available": 2484, "swap_space": 2485, "text_prompt_kwargs": 2486, "prompt_embeds": 2487, "req_outputs": 2488, "req_output": 2489, "prompt_str": 2490, "req_sample_output_ids": 2491, "req_sample_output_strs": 2492, "_final_steps_generate_w_logprobs": 2493, "tokenstextlogprobspromptlogprobs": 2494, "prompt_logprobs": 2495, "generate_w_logprobs": 2496, "toks_str_logsprobs_prompt_logprobs": 2497, "omit": 2498, "generate_encoder_decoder_w_logprobs": 2499, "greedy_params": 2500, "num_prompt_logprobs": 2501, "stop_token_ids": 2502, "stop": 2503, "greedy_logprobs_params": 2504, "generate_encoder_decoder_greedy_logprobs": 2505, "num_prompt_logp": 2506, "robs": 2507, "returned_outputs": 2508, "texts": 2509, "probs": 2510, "embed": 2511, "reward": 2512, "text_1": 2513, "text_2": 2514, "apply_model": 2515, "func": 2516, "nn": 2517, "_r": 2518, "vllm_enable_v1_multiprocessing": 2519, "executor": 2520, "vllm_allow_insecure_serialization": 2521, "_apply_model": 2522, "collective_rpc": 2523, "vllm_runner": 2524, "temporary_enable_log_propagate": 2525, "getlogger": 2526, "propagate": 2527, "caplog_vllm": 2528, "caplog": 2529, "capture": 2530, "log": 2531, "temporarily": 2532, "logs": 2533, "propagated": 2534, "num_gpus_available": 2535, "gpus": 2536, "initializing": 2537, "dummy_opt_path": 2538, "json_path": 2539, "_dummy_opt_path": 2540, "repo_id": 2541, "local_dir": 2542, "ignore_patterns": 2543, "h5": 2544, "msgpack": 2545, "architectures": 2546, "myoptforcausallm": 2547, "dummy_llava_path": 2548, "_dummy_llava_path": 2549, "7b": 2550, "myllava": 2551, "dummy_gemma2_embedding_path": 2552, "_dummy_gemma2_embedding_path": 2553, "baai": 2554, "bge": 2555, "multilingual": 2556, "gemma2": 2557, "mygemma2embedding": 2558, "pytest_addoption": 2559, "addoption": 2560, "pytest_collection_modifyitems": 2561, "getoption": 2562, "cli": 2563, "skip_optional": 2564, "mark": 2565, "keywords": 2566, "add_marker": 2567, "cli_config_file": 2568, "_test_dir": 2569, "test_config": 2570, "yaml": 2571, "cli_config_file_with_model": 2572, "test_config_with_model": 2573, "flatten_2d": 2574, "li": 2575, "lss": 2576, "ls": 2577, "test_auto_prefix_caching": 2578, "max_num_seqs": 2579, "concurrent_lora_int_ids": 2580, "tokenizergroup": 2581, "max_input_length": 2582, "hashes": 2583, "prefixes": 2584, "example_lora_": 2585, "lora_": 2586, "sample_prompts": 2587, "seq_id": 2588, "seq": 2589, "token_inputs": 2590, "eos_token_id": 2591, "num_blocks": 2592, "hash_of_block": 2593, "everywhere": 2594, "hash0": 2595, "hash1": 2596, "until": 2597, "hash_pref": 2598, "same_hashes": 2599, "different_hashes": 2600, "ha": 2601, "sh_pref": 2602, "test_compile_config_repr_succeeds": 2603, "vllmbackend": 2604, "mutates": 2605, "configure_post_pass": 2606, "repr": 2607, "succeeds": 2608, "val": 2609, "inductor_passes": 2610, "_testconfigfields": 2611, "test_get_field": 2612, "get_field": 2613, "_testnestedconfig": 2614, "test_update_config": 2615, "simple": 2616, "config1": 2617, "new_config1": 2618, "update_config": 2619, "42": 2620, "nonexistent": 2621, "assertionerror": 2622, "nested": 2623, "dataclass": 2624, "config2": 2625, "new_inner_config": 2626, "new_value": 2627, "new_config2": 2628, 